Israr-Engineering/PMM-11XX-RENEWABLE/custom_Board/1.8.13/boards.txt
# PMM0606 (ESI High Speed Data Logger)
# --------------------------------------
PMM0606.name=PMM0606 (ESI High Speed Data Logger)
PMM0606.vid.0=0x2341
PMM0606.pid.0=0x804d
PMM0606.vid.1=0x2341
PMM0606.pid.1=0x004d
PMM0606.vid.2=0x2341
PMM0606.pid.2=0x824d
PMM0606.vid.3=0x2341
PMM0606.pid.3=0x024d
PMM0606.upload_port.0.vid=0x2341
PMM0606.upload_port.0.pid=0x804d
PMM0606.upload_port.1.vid=0x2341
PMM0606.upload_port.1.pid=0x004d
PMM0606.upload_port.2.vid=0x2341
PMM0606.upload_port.2.pid=0x824d
PMM0606.upload_port.3.vid=0x2341
PMM0606.upload_port.3.pid=0x024d
PMM0606.upload_port.4.board=arduino_zero_native
PMM0606.build.usb_product="PMM0606"
PMM0606.upload.tool=bossac
PMM0606.upload.tool.default=bossac
PMM0606.upload.tool.network=arduino_ota
PMM0606.upload.protocol=sam-ba
PMM0606.upload.maximum_size=262144
PMM0606.upload.maximum_data_size=32768
PMM0606.upload.use_1200bps_touch=true
PMM0606.upload.wait_for_upload_port=true
PMM0606.upload.native_usb=true
PMM0606.build.mcu=cortex-m0plus
PMM0606.build.f_cpu=48000000L
PMM0606.build.usb_product="pmm0606"
PMM0606.build.usb_manufacturer="PMM LLC"
PMM0606.build.board=pmm0606
PMM0606.build.core=arduino
PMM0606.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0606.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0606.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0606.build.variant=pmm0606
PMM0606.build.variant_system_lib=
PMM0606.build.vid=0x2341
PMM0606.build.pid=0x804d
PMM0606.bootloader.tool=openocd
PMM0606.bootloader.tool.default=openocd
PMM0606.bootloader.file=zero/samd21_sam_ba.bin

# PMM0610 (ESI Base Blutooth and Ethernet)
# --------------------------------------
PMM0610.name=PMM0610 (ESI Base Blutooth and Ethernet)
PMM0610.vid.0=0x2341
PMM0610.pid.0=0x804d
PMM0610.vid.1=0x2341
PMM0610.pid.1=0x004d
PMM0610.vid.2=0x2341
PMM0610.pid.2=0x824d
PMM0610.vid.3=0x2341
PMM0610.pid.3=0x024d
PMM0610.upload_port.0.vid=0x2341
PMM0610.upload_port.0.pid=0x804d
PMM0610.upload_port.1.vid=0x2341
PMM0610.upload_port.1.pid=0x004d
PMM0610.upload_port.2.vid=0x2341
PMM0610.upload_port.2.pid=0x824d
PMM0610.upload_port.3.vid=0x2341
PMM0610.upload_port.3.pid=0x024d
PMM0610.upload_port.4.board=arduino_zero_native
PMM0610.build.usb_product="PMM0610"
PMM0606.upload.tool=bossac
PMM0610.upload.tool.default=bossac
PMM0610.upload.tool.network=arduino_ota
PMM0610.upload.protocol=sam-ba
PMM0610.upload.maximum_size=262144
PMM0610.upload.maximum_data_size=32768
PMM0610.upload.use_1200bps_touch=true
PMM0610.upload.wait_for_upload_port=true
PMM0610.upload.native_usb=true
PMM0610.build.mcu=cortex-m0plus
PMM0610.build.f_cpu=48000000L
PMM0610.build.usb_product="pmm0610"
PMM0610.build.usb_manufacturer="PMM LLC"
PMM0610.build.board=pmm0610
PMM0610.build.core=arduino
PMM0610.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0610.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0610.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0610.build.variant=pmm0610
PMM0610.build.variant_system_lib=
PMM0610.build.vid=0x2341
PMM0610.build.pid=0x804d
PMM0610.bootloader.tool=openocd
PMM0610.bootloader.tool.default=openocd
PMM0610.bootloader.file=zero/samd21_sam_ba.bin

# PMM0612 (ESI F.O 1x9 ro Rsxxx BusLink)
# --------------------------------------
PMM0612.name=PMM0612 (ESI F.O 1x9 ro Rsxxx BusLink)
PMM0612.vid.0=0x2341
PMM0612.pid.0=0x804d
PMM0612.vid.1=0x2341
PMM0612.pid.1=0x004d
PMM0612.vid.2=0x2341
PMM0612.pid.2=0x824d
PMM0612.vid.3=0x2341
PMM0612.pid.3=0x024d
PMM0612.upload_port.0.vid=0x2341
PMM0612.upload_port.0.pid=0x804d
PMM0612.upload_port.1.vid=0x2341
PMM0612.upload_port.1.pid=0x004d
PMM0612.upload_port.2.vid=0x2341
PMM0612.upload_port.2.pid=0x824d
PMM0612.upload_port.3.vid=0x2341
PMM0612.upload_port.3.pid=0x024d
PMM0612.upload_port.4.board=arduino_zero_native
PMM0612.build.usb_product="PMM0612"
PMM0612.upload.tool=bossac
PMM0612.upload.tool.default=bossac
PMM0612.upload.tool.network=arduino_ota
PMM0612.upload.protocol=sam-ba
PMM0612.upload.maximum_size=262144
PMM0612.upload.maximum_data_size=32768
PMM0612.upload.use_1200bps_touch=true
PMM0612.upload.wait_for_upload_port=true
PMM0612.upload.native_usb=true
PMM0612.build.mcu=cortex-m0plus
PMM0612.build.f_cpu=48000000L
PMM0612.build.usb_product="pmm0612"
PMM0612.build.usb_manufacturer="PMM LLC"
PMM0612.build.board=pmm0612
PMM0612.build.core=arduino
PMM0612.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0612.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0612.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0612.build.variant=pmm0612
PMM0612.build.variant_system_lib=
PMM0612.build.vid=0x2341
PMM0612.build.pid=0x804d
PMM0612.bootloader.tool=openocd
PMM0612.bootloader.tool.default=openocd
PMM0612.bootloader.file=zero/samd21_sam_ba.bin

# pmm0620 (ESI 12x Digital Inputs)
# --------------------------------------
pmm0620.name=pmm0620(ESI 12x Digital Inputs)
pmm0620.vid.0=0x2341
pmm0620.pid.0=0x804d
pmm0620.vid.1=0x2341
pmm0620.pid.1=0x004d
pmm0620.vid.2=0x2341
pmm0620.pid.2=0x824d
pmm0620.vid.3=0x2341
pmm0620.pid.3=0x024d
pmm0620.upload_port.0.vid=0x2341
pmm0620.upload_port.0.pid=0x804d
pmm0620.upload_port.1.vid=0x2341
pmm0620.upload_port.1.pid=0x004d
pmm0620.upload_port.2.vid=0x2341
pmm0620.upload_port.2.pid=0x824d
pmm0620.upload_port.3.vid=0x2341
pmm0620.upload_port.3.pid=0x024d
pmm0620.upload_port.4.board=pmm0620

pmm0620.upload.tool=bossac
pmm0620.upload.tool.default=bossac
pmm0620.upload.tool.network=arduino_ota
pmm0620.upload.protocol=sam-ba
pmm0620.upload.maximum_size=262144
pmm0620.upload.maximum_data_size=32768
pmm0620.upload.use_1200bps_touch=true
pmm0620.upload.wait_for_upload_port=true
pmm0620.upload.native_usb=true
pmm0620.build.mcu=cortex-m0plus
pmm0620.build.f_cpu=48000000L
pmm0620.build.usb_product="PMM0620"
pmm0620.build.usb_manufacturer="PMM LLC"
pmm0620.build.board=SAMD_ZERO
pmm0620.build.core=arduino
pmm0620.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
pmm0620.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
pmm0620.build.openocdscript=openocd_scripts/pmm0620.cfg
pmm0620.build.variant=pmm0620
pmm0620.build.variant_system_lib=
pmm0620.build.vid=0x2341
pmm0620.build.pid=0x804d
pmm0620.bootloader.tool=openocd
pmm0620.bootloader.tool.default=openocd
pmm0620.bootloader.file=zero/samd21_sam_ba.bin



# PMM0620X (SI 16x Digital Inputs)
# --------------------------------------
PMM0620X.name=PMM0620X (SI 16x Digital Inputs)
PMM0620X.vid.0=0x2341
PMM0620X.pid.0=0x804d
PMM0620X.vid.1=0x2341
PMM0620X.pid.1=0x004d
PMM0620X.vid.2=0x2341
PMM0620X.pid.2=0x824d
PMM0620X.vid.3=0x2341
PMM0620X.pid.3=0x024d
PMM0620X.upload_port.0.vid=0x2341
PMM0620X.upload_port.0.pid=0x804d
PMM0620X.upload_port.1.vid=0x2341
PMM0620X.upload_port.1.pid=0x004d
PMM0620X.upload_port.2.vid=0x2341
PMM0620X.upload_port.2.pid=0x824d
PMM0620X.upload_port.3.vid=0x2341
PMM0620X.upload_port.3.pid=0x024d
PMM0620X.upload_port.4.board=arduino_zero_native
PMM0620X.build.usb_product="PMM0620X"
PMM0620X.upload.tool=bossac
PMM0620X.upload.tool.default=bossac
PMM0620X.upload.tool.network=arduino_ota
PMM0620X.upload.protocol=sam-ba
PMM0620X.upload.maximum_size=262144
PMM0620X.upload.maximum_data_size=32768
PMM0620X.upload.use_1200bps_touch=true
PMM0620X.upload.wait_for_upload_port=true
PMM0620X.upload.native_usb=true
PMM0620X.build.mcu=cortex-m0plus
PMM0620X.build.f_cpu=48000000L
PMM0620X.build.usb_product="pmm0620X"
PMM0620X.build.usb_manufacturer="PMM LLC"
PMM0620X.build.board=pmm0620X
PMM0620X.build.core=arduino
PMM0620X.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0620X.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0620X.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0620X.build.variant=pmm0620X
PMM0620X.build.variant_system_lib=
PMM0620X.build.vid=0x2341
PMM0620X.build.pid=0x804d
PMM0620X.bootloader.tool=openocd
PMM0620X.bootloader.tool.default=openocd
PMM0620X.bootloader.file=zero/samd21_sam_ba.bin

# PMM0625 ( ESI SET 8x Digital Output)
# --------------------------------------
PMM0625.name=PMM0625 ( ESI SET 8x Digital Output)
PMM0625.vid.0=0x2341
PMM0625.pid.0=0x804d
PMM0625.vid.1=0x2341
PMM0625.pid.1=0x004d
PMM0625.vid.2=0x2341
PMM0625.pid.2=0x824d
PMM0625.vid.3=0x2341
PMM0625.pid.3=0x024d
PMM0625.upload_port.0.vid=0x2341
PMM0625.upload_port.0.pid=0x804d
PMM0625.upload_port.1.vid=0x2341
PMM0625.upload_port.1.pid=0x004d
PMM0625.upload_port.2.vid=0x2341
PMM0625.upload_port.2.pid=0x824d
PMM0625.upload_port.3.vid=0x2341
PMM0625.upload_port.3.pid=0x024d
PMM0625.upload_port.4.board=arduino_zero_native
PMM0625.build.usb_product="PMM0625"
PMM0625.upload.tool=bossac
PMM0625.upload.tool.default=bossac
PMM0625.upload.tool.network=arduino_ota
PMM0625.upload.protocol=sam-ba
PMM0625.upload.maximum_size=262144
PMM0625.upload.maximum_data_size=32768
PMM0625.upload.use_1200bps_touch=true
PMM0625.upload.wait_for_upload_port=true
PMM0625.upload.native_usb=true
PMM0625.build.mcu=cortex-m0plus
PMM0625.build.f_cpu=48000000L
PMM0625.build.usb_product="pmm0625"
PMM0625.build.usb_manufacturer="PMM LLC"
PMM0625.build.board=pmm0625
PMM0625.build.core=arduino
PMM0625.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0625.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0625.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0625.build.variant=pmm0625
PMM0625.build.variant_system_lib=
PMM0625.build.vid=0x2341
PMM0625.build.pid=0x804d
PMM0625.bootloader.tool=openocd
PMM0625.bootloader.tool.default=openocd
PMM0625.bootloader.file=zero/samd21_sam_ba.bin

# PMM0625X (SI 16x Digital Inputs T)
# --------------------------------------
PMM0625X.name=PMM0625X (SI 16x Digital Inputs T)
PMM0625X.vid.0=0x2341
PMM0625X.pid.0=0x804d
PMM0625X.vid.1=0x2341
PMM0625X.pid.1=0x004d
PMM0625X.vid.2=0x2341
PMM0625X.pid.2=0x824d
PMM0625X.vid.3=0x2341
PMM0625X.pid.3=0x024d
PMM0625X.upload_port.0.vid=0x2341
PMM0625X.upload_port.0.pid=0x804d
PMM0625X.upload_port.1.vid=0x2341
PMM0625X.upload_port.1.pid=0x004d
PMM0625X.upload_port.2.vid=0x2341
PMM0625X.upload_port.2.pid=0x824d
PMM0625X.upload_port.3.vid=0x2341
PMM0625X.upload_port.3.pid=0x024d
PMM0625X.upload_port.4.board=arduino_zero_native
PMM0625X.build.usb_product="PMM0625X"
PMM0625X.upload.tool=bossac
PMM0625X.upload.tool.default=bossac
PMM0625X.upload.tool.network=arduino_ota
PMM0625X.upload.protocol=sam-ba
PMM0625X.upload.maximum_size=262144
PMM0625X.upload.maximum_data_size=32768
PMM0625X.upload.use_1200bps_touch=true
PMM0625X.upload.wait_for_upload_port=true
PMM0625X.upload.native_usb=true
PMM0625X.build.mcu=cortex-m0plus
PMM0625X.build.f_cpu=48000000L
PMM0625X.build.usb_product="pmm0625X"
PMM0625X.build.usb_manufacturer="PMM LLC"
PMM0625X.build.board=pmm0625X
PMM0625X.build.core=arduino
PMM0625X.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0625X.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0625X.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0625X.build.variant=pmm0625X
PMM0625X.build.variant_system_lib=
PMM0625X.build.vid=0x2341
PMM0625X.build.pid=0x804d
PMM0625X.bootloader.tool=openocd
PMM0625X.bootloader.tool.default=openocd
PMM0625X.bootloader.file=zero/samd21_sam_ba.bin

# PMM0626 (ESI SER 8x Digital Output)
# --------------------------------------
PMM0626.name=PMM0626 (ESI SER 8x Digital Output)
PMM0626.vid.0=0x2341
PMM0626.pid.0=0x804d
PMM0626.vid.1=0x2341
PMM0626.pid.1=0x004d
PMM0626.vid.2=0x2341
PMM0626.pid.2=0x824d
PMM0626.vid.3=0x2341
PMM0626.pid.3=0x024d
PMM0626.upload_port.0.vid=0x2341
PMM0626.upload_port.0.pid=0x804d
PMM0626.upload_port.1.vid=0x2341
PMM0626.upload_port.1.pid=0x004d
PMM0626.upload_port.2.vid=0x2341
PMM0626.upload_port.2.pid=0x824d
PMM0626.upload_port.3.vid=0x2341
PMM0626.upload_port.3.pid=0x024d
PMM0626.upload_port.4.board=arduino_zero_native
PMM0626.build.usb_product="PMM0626"
PMM0626.upload.tool=bossac
PMM0626.upload.tool.default=bossac
PMM0626.upload.tool.network=arduino_ota
PMM0626.upload.protocol=sam-ba
PMM0626.upload.maximum_size=262144
PMM0626.upload.maximum_data_size=32768
PMM0626.upload.use_1200bps_touch=true
PMM0626.upload.wait_for_upload_port=true
PMM0626.upload.native_usb=true
PMM0626.build.mcu=cortex-m0plus
PMM0626.build.f_cpu=48000000L
PMM0626.build.usb_product="pmm0626"
PMM0626.build.usb_manufacturer="PMM LLC"
PMM0626.build.board=pmm0626
PMM0626.build.core=arduino
PMM0626.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0626.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0626.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0626.build.variant=pmm0626
PMM0626.build.variant_system_lib=
PMM0626.build.vid=0x2341
PMM0626.build.pid=0x804d
PMM0626.bootloader.tool=openocd
PMM0626.bootloader.tool.default=openocd
PMM0626.bootloader.file=zero/samd21_sam_ba.bin


# PMM0626X (SI 16x Digital Output R)
# -------------------------------------
PMM0626X.name=PMM0626X  (SI 16x Digital Output R)
PMM0626X.vid.0=0x2341
PMM0626X.pid.0=0x804d
PMM0626X.vid.1=0x2341
PMM0626X.pid.1=0x004d
PMM0626X.vid.2=0x2341
PMM0626X.pid.2=0x824d
PMM0626X.vid.3=0x2341
PMM0626X.pid.3=0x024d
PMM0626X.upload_port.0.vid=0x2341
PMM0626X.upload_port.0.pid=0x804d
PMM0626X.upload_port.1.vid=0x2341
PMM0626X.upload_port.1.pid=0x004d
PMM0626X.upload_port.2.vid=0x2341
PMM0626X.upload_port.2.pid=0x824d
PMM0626X.upload_port.3.vid=0x2341
PMM0626X.upload_port.3.pid=0x024d
PMM0626X.upload_port.4.board=arduino_zero_native
PMM0626X.build.usb_product="PMM0626X"
PMM0626X.upload.tool=bossac
PMM0626X.upload.tool.default=bossac
PMM0626X.upload.tool.network=arduino_ota
PMM0626X.upload.protocol=sam-ba
PMM0626X.upload.maximum_size=262144
PMM0626X.upload.maximum_data_size=32768
PMM0626X.upload.use_1200bps_touch=true
PMM0626X.upload.wait_for_upload_port=true
PMM0626X.upload.native_usb=true
PMM0626X.build.mcu=cortex-m0plus
PMM0626X.build.f_cpu=48000000L
PMM0626X.build.usb_product="pmm0626X"
PMM0626X.build.usb_manufacturer="PMM LLC"
PMM0626X.build.board=pmm0626X
PMM0626X.build.core=arduino
PMM0626X.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0626X.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0626X.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0626X.build.variant=pmm0626X
PMM0626X.build.variant_system_lib=
PMM0626X.build.vid=0x2341
PMM0626X.build.pid=0x804d
PMM0626X.bootloader.tool=openocd
PMM0626X.bootloader.tool.default=openocd
PMM0626X.bootloader.file=zero/samd21_sam_ba.bin

# PMM0627 ( ESI SEAC 8x Digital Output)
# --------------------------------------
PMM0627.name=PMM0627 ( ESI SEAC 8x Digital Output)
PMM0627.vid.0=0x2341
PMM0627.pid.0=0x804d
PMM0627.vid.1=0x2341
PMM0627.pid.1=0x004d
PMM0627.vid.2=0x2341
PMM0627.pid.2=0x824d
PMM0627.vid.3=0x2341
PMM0627.pid.3=0x024d
PMM0627.upload_port.0.vid=0x2341
PMM0627.upload_port.0.pid=0x804d
PMM0627.upload_port.1.vid=0x2341
PMM0627.upload_port.1.pid=0x004d
PMM0627.upload_port.2.vid=0x2341
PMM0627.upload_port.2.pid=0x824d
PMM0627.upload_port.3.vid=0x2341
PMM0627.upload_port.3.pid=0x024d
PMM0627.upload_port.4.board=arduino_zero_native
PMM0627.build.usb_product="PMM0627"
PMM0627.upload.tool=bossac
PMM0627.upload.tool.default=bossac
PMM0627.upload.tool.network=arduino_ota
PMM0627.upload.protocol=sam-ba
PMM0627.upload.maximum_size=262144
PMM0627.upload.maximum_data_size=32768
PMM0627.upload.use_1200bps_touch=true
PMM0627.upload.wait_for_upload_port=true
PMM0627.upload.native_usb=true
PMM0627.build.mcu=cortex-m0plus
PMM0627.build.f_cpu=48000000L
PMM0627.build.usb_product="pmm0627"
PMM0627.build.usb_manufacturer="PMM LLC"
PMM0627.build.board=pmm0627
PMM0627.build.core=arduino
PMM0627.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0627.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0627.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0627.build.variant=pmm0627
PMM0627.build.variant_system_lib=
PMM0627.build.vid=0x2341
PMM0627.build.pid=0x804d
PMM0627.bootloader.tool=openocd
PMM0627.bootloader.tool.default=openocd
PMM0627.bootloader.file=zero/samd21_sam_ba.bin

# PMM0628R (ESI 8x Inputs 4x Relay Outputs)
# --------------------------------------
PMM0628R.name=PMM0628R (ESI 8x Inputs 4x Relay Outputs)
PMM0628R.vid.0=0x2341
PMM0628R.pid.0=0x804d
PMM0628R.vid.1=0x2341
PMM0628R.pid.1=0x004d
PMM0628R.vid.2=0x2341
PMM0628R.pid.2=0x824d
PMM0628R.vid.3=0x2341
PMM0628R.pid.3=0x024d
PMM0628R.upload_port.0.vid=0x2341
PMM0628R.upload_port.0.pid=0x804d
PMM0628R.upload_port.1.vid=0x2341
PMM0628R.upload_port.1.pid=0x004d
PMM0628R.upload_port.2.vid=0x2341
PMM0628R.upload_port.2.pid=0x824d
PMM0628R.upload_port.3.vid=0x2341
PMM0628R.upload_port.3.pid=0x024d
PMM0628R.upload_port.4.board=arduino_zero_native
PMM0628R.build.usb_product="PMM0628R"
PMM0628R.upload.tool=bossac
PMM0628R.upload.tool.default=bossac
PMM0628R.upload.tool.network=arduino_ota
PMM0628R.upload.protocol=sam-ba
PMM0628R.upload.maximum_size=262144
PMM0628R.upload.maximum_data_size=32768
PMM0628R.upload.use_1200bps_touch=true
PMM0628R.upload.wait_for_upload_port=true
PMM0628R.upload.native_usb=true
PMM0628R.build.mcu=cortex-m0plus
PMM0628R.build.f_cpu=48000000L
PMM0628R.build.usb_product="pmm0628R"
PMM0628R.build.usb_manufacturer="PMM LLC"
PMM0628R.build.board=pmm0628R
PMM0628R.build.core=arduino
PMM0628R.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0628R.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0628R.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0628R.build.variant=pmm0628R
PMM0628R.build.variant_system_lib=
PMM0628R.build.vid=0x2341
PMM0628R.build.pid=0x804d
PMM0628R.bootloader.tool=openocd
PMM0628R.bootloader.tool.default=openocd
PMM0628R.bootloader.file=zero/samd21_sam_ba.bin

