Israr-Engineering/PMM-11XX-RENEWABLE/custom_Board/1.8.13/boards.txt
# PMM0628RX (SI 12x Digital Inputs 6x Digital Outputs)
# -------------------------------------
PMM0628RX.name=PMM0628RX (SI 12x Digital Inputs 6x Digital Outputs)
PMM0628RX.vid.0=0x2341
PMM0628RX.pid.0=0x804d
PMM0628RX.vid.1=0x2341
PMM0628RX.pid.1=0x004d
PMM0628RX.vid.2=0x2341
PMM0628RX.pid.2=0x824d
PMM0628RX.vid.3=0x2341
PMM0628RX.pid.3=0x024d
PMM0628RX.upload_port.0.vid=0x2341
PMM0628RX.upload_port.0.pid=0x804d
PMM0628RX.upload_port.1.vid=0x2341
PMM0628RX.upload_port.1.pid=0x004d
PMM0628RX.upload_port.2.vid=0x2341
PMM0628RX.upload_port.2.pid=0x824d
PMM0628RX.upload_port.3.vid=0x2341
PMM0628RX.upload_port.3.pid=0x024d
PMM0628RX.upload_port.4.board=arduino_zero_native
PMM0628RX.build.usb_product="PMM0628RX"
PMM0628RX.upload.tool=bossac
PMM0628RX.upload.tool.default=bossac
PMM0628RX.upload.tool.network=arduino_ota
PMM0628RX.upload.protocol=sam-ba
PMM0628RX.upload.maximum_size=262144
PMM0628RX.upload.maximum_data_size=32768
PMM0628RX.upload.use_1200bps_touch=true
PMM0628RX.upload.wait_for_upload_port=true
PMM0628RX.upload.native_usb=true
PMM0628RX.build.mcu=cortex-m0plus
PMM0628RX.build.f_cpu=48000000L
PMM0628RX.build.usb_product="pmm0628RX"
PMM0628RX.build.usb_manufacturer="PMM LLC"
PMM0628RX.build.board=pmm0628RX
PMM0628RX.build.core=arduino
PMM0628RX.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0628RX.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0628RX.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0628RX.build.variant=pmm0628RX
PMM0628RX.build.variant_system_lib=
PMM0628RX.build.vid=0x2341
PMM0628RX.build.pid=0x804d
PMM0628RX.bootloader.tool=openocd
PMM0628RX.bootloader.tool.default=openocd
PMM0628RX.bootloader.file=zero/samd21_sam_ba.bin

# PMM0628T ( ESI 8x Inputs 4x Transistor Outputs)
# --------------------------------------
PMM0628T.name=PMM0628T ( ESI 8x Inputs 4x Transistor Outputs)
PMM0628T.vid.0=0x2341
PMM0628T.pid.0=0x804d
PMM0628T.vid.1=0x2341
PMM0628T.pid.1=0x004d
PMM0628T.vid.2=0x2341
PMM0628T.pid.2=0x824d
PMM0628T.vid.3=0x2341
PMM0628T.pid.3=0x024d
PMM0628T.upload_port.0.vid=0x2341
PMM0628T.upload_port.0.pid=0x804d
PMM0628T.upload_port.1.vid=0x2341
PMM0628T.upload_port.1.pid=0x004d
PMM0628T.upload_port.2.vid=0x2341
PMM0628T.upload_port.2.pid=0x824d
PMM0628T.upload_port.3.vid=0x2341
PMM0628T.upload_port.3.pid=0x024d
PMM0628T.upload_port.4.board=arduino_zero_native
PMM0628T.build.usb_product="PMM0628T"
PMM0628T.upload.tool=bossac
PMM0628T.upload.tool.default=bossac
PMM0628T.upload.tool.network=arduino_ota
PMM0628T.upload.protocol=sam-ba
PMM0628T.upload.maximum_size=262144
PMM0628T.upload.maximum_data_size=32768
PMM0628T.upload.use_1200bps_touch=true
PMM0628T.upload.wait_for_upload_port=true
PMM0628T.upload.native_usb=true
PMM0628T.build.mcu=cortex-m0plus
PMM0628T.build.f_cpu=48000000L
PMM0628T.build.usb_product="pmm0628T"
PMM0628T.build.usb_manufacturer="PMM LLC"
PMM0628T.build.board=pmm0628T
PMM0628T.build.core=arduino
PMM0628T.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0628T.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0628T.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0628T.build.variant=pmm0628T
PMM0628T.build.variant_system_lib=
PMM0628T.build.vid=0x2341
PMM0628T.build.pid=0x804d
PMM0628T.bootloader.tool=openocd
PMM0628T.bootloader.tool.default=openocd
PMM0628T.bootloader.file=zero/samd21_sam_ba.bin

# PMM0628TX (SI 12x Digital Inputs 6x Digital Outputs)
# -------------------------------------
PMM0628TX.name=PMM0628TX (SI 12x Digital Inputs 6x Digital Outputs)
PMM0628TX.vid.0=0x2341
PMM0628TX.pid.0=0x804d
PMM0628TX.vid.1=0x2341
PMM0628TX.pid.1=0x004d
PMM0628TX.vid.2=0x2341
PMM0628TX.pid.2=0x824d
PMM0628TX.vid.3=0x2341
PMM0628TX.pid.3=0x024d
PMM0628TX.upload_port.0.vid=0x2341
PMM0628TX.upload_port.0.pid=0x804d
PMM0628TX.upload_port.1.vid=0x2341
PMM0628TX.upload_port.1.pid=0x004d
PMM0628TX.upload_port.2.vid=0x2341
PMM0628TX.upload_port.2.pid=0x824d
PMM0628TX.upload_port.3.vid=0x2341
PMM0628TX.upload_port.3.pid=0x024d
PMM0628TX.upload_port.4.board=arduino_zero_native
PMM0628TX.build.usb_product="PMM0628TX"
PMM0628TX.upload.tool=bossac
PMM0628TX.upload.tool.default=bossac
PMM0628TX.upload.tool.network=arduino_ota
PMM0628TX.upload.protocol=sam-ba
PMM0628TX.upload.maximum_size=262144
PMM0628TX.upload.maximum_data_size=32768
PMM0628TX.upload.use_1200bps_touch=true
PMM0628TX.upload.wait_for_upload_port=true
PMM0628TX.upload.native_usb=true
PMM0628TX.build.mcu=cortex-m0plus
PMM0628TX.build.f_cpu=48000000L
PMM0628TX.build.usb_product="pmm0628TX"
PMM0628TX.build.usb_manufacturer="PMM LLC"
PMM0628TX.build.board=pmm0628TX
PMM0628TX.build.core=arduino
PMM0628TX.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0628TX.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0628TX.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0628TX.build.variant=pmm0628TX
PMM0628TX.build.variant_system_lib=
PMM0628TX.build.vid=0x2341
PMM0628TX.build.pid=0x804d
PMM0628TX.bootloader.tool=openocd
PMM0628TX.bootloader.tool.default=openocd
PMM0628TX.bootloader.file=zero/samd21_sam_ba.bin

# PMM0630 (SE 8x Analog Inputs)
# --------------------------------------
PMM0630.name=PMM0630 (SE 8x Analog Inputs)
PMM0630.vid.0=0x2341
PMM0630.pid.0=0x804d
PMM0630.vid.1=0x2341
PMM0630.pid.1=0x004d
PMM0630.vid.2=0x2341
PMM0630.pid.2=0x824d
PMM0630.vid.3=0x2341
PMM0630.pid.3=0x024d
PMM0630.upload_port.0.vid=0x2341
PMM0630.upload_port.0.pid=0x804d
PMM0630.upload_port.1.vid=0x2341
PMM0630.upload_port.1.pid=0x004d
PMM0630.upload_port.2.vid=0x2341
PMM0630.upload_port.2.pid=0x824d
PMM0630.upload_port.3.vid=0x2341
PMM0630.upload_port.3.pid=0x024d
PMM0630.upload_port.4.board=arduino_zero_native
PMM0630.build.usb_product="PMM0630"
PMM0630.upload.tool=bossac
PMM0630.upload.tool.default=bossac
PMM0630.upload.tool.network=arduino_ota
PMM0630.upload.protocol=sam-ba
PMM0630.upload.maximum_size=262144
PMM0630.upload.maximum_data_size=32768
PMM0630.upload.use_1200bps_touch=true
PMM0630.upload.wait_for_upload_port=true
PMM0630.upload.native_usb=true
PMM0630.build.mcu=cortex-m0plus
PMM0630.build.f_cpu=48000000L
PMM0630.build.usb_product="pmm0630"
PMM0630.build.usb_manufacturer="PMM LLC"
PMM0630.build.board=pmm0630
PMM0630.build.core=arduino
PMM0630.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0630.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0630.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0630.build.variant=pmm0630
PMM0630.build.variant_system_lib=
PMM0630.build.vid=0x2341
PMM0630.build.pid=0x804d
PMM0630.bootloader.tool=openocd
PMM0630.bootloader.tool.default=openocd
PMM0630.bootloader.file=zero/samd21_sam_ba.bin

# PMM0631 (SE 4x Analog Input)
# --------------------------------------
PMM0631.name=PMM0631 (SE 4x Analog Input)
PMM0631.vid.0=0x2341
PMM0631.pid.0=0x804d
PMM0631.vid.1=0x2341
PMM0631.pid.1=0x004d
PMM0631.vid.2=0x2341
PMM0631.pid.2=0x824d
PMM0631.vid.3=0x2341
PMM0631.pid.3=0x024d
PMM0631.upload_port.0.vid=0x2341
PMM0631.upload_port.0.pid=0x804d
PMM0631.upload_port.1.vid=0x2341
PMM0631.upload_port.1.pid=0x004d
PMM0631.upload_port.2.vid=0x2341
PMM0631.upload_port.2.pid=0x824d
PMM0631.upload_port.3.vid=0x2341
PMM0631.upload_port.3.pid=0x024d
PMM0631.upload_port.4.board=arduino_zero_native
PMM0631.build.usb_product="PMM0631"
PMM0631.upload.tool=bossac
PMM0631.upload.tool.default=bossac
PMM0631.upload.tool.network=arduino_ota
PMM0631.upload.protocol=sam-ba
PMM0631.upload.maximum_size=262144
PMM0631.upload.maximum_data_size=32768
PMM0631.upload.use_1200bps_touch=true
PMM0631.upload.wait_for_upload_port=true
PMM0631.upload.native_usb=true
PMM0631.build.mcu=cortex-m0plus
PMM0631.build.f_cpu=48000000L
PMM0631.build.usb_product="pmm0631"
PMM0631.build.usb_manufacturer="PMM LLC"
PMM0631.build.board=pmm0631
PMM0631.build.core=arduino
PMM0631.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0631.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0631.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0631.build.variant=pmm0631
PMM0631.build.variant_system_lib=
PMM0631.build.vid=0x2341
PMM0631.build.pid=0x804d
PMM0631.bootloader.tool=openocd
PMM0631.bootloader.tool.default=openocd
PMM0631.bootloader.file=zero/samd21_sam_ba.bin

