Israr-Engineering/PMM-11XX-RENEWABLE/custom_Board/1.8.13/boards.txt
# PMM0632 (ESI 8x Analog Inputs)
# --------------------------------------
PMM0632.name=PMM0632 (ESI 8x Analog Inputs)
PMM0632.vid.0=0x2341
PMM0632.pid.0=0x804d
PMM0632.vid.1=0x2341
PMM0632.pid.1=0x004d
PMM0632.vid.2=0x2341
PMM0632.pid.2=0x824d
PMM0632.vid.3=0x2341
PMM0632.pid.3=0x024d
PMM0632.upload_port.0.vid=0x2341
PMM0632.upload_port.0.pid=0x804d
PMM0632.upload_port.1.vid=0x2341
PMM0632.upload_port.1.pid=0x004d
PMM0632.upload_port.2.vid=0x2341
PMM0632.upload_port.2.pid=0x824d
PMM0632.upload_port.3.vid=0x2341
PMM0632.upload_port.3.pid=0x024d
PMM0632.upload_port.4.board=arduino_zero_native
PMM0632.build.usb_product="PMM0632"
PMM0632.upload.tool=bossac
PMM0632.upload.tool.default=bossac
PMM0632.upload.tool.network=arduino_ota
PMM0632.upload.protocol=sam-ba
PMM0632.upload.maximum_size=262144
PMM0632.upload.maximum_data_size=32768
PMM0632.upload.use_1200bps_touch=true
PMM0632.upload.wait_for_upload_port=true
PMM0632.upload.native_usb=true
PMM0632.build.mcu=cortex-m0plus
PMM0632.build.f_cpu=48000000L
PMM0632.build.usb_product="pmm0632"
PMM0632.build.usb_manufacturer="PMM LLC"
PMM0632.build.board=pmm0632
PMM0632.build.core=arduino
PMM0632.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0632.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0632.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0632.build.variant=pmm0632
PMM0632.build.variant_system_lib=
PMM0632.build.vid=0x2341
PMM0632.build.pid=0x804d
PMM0632.bootloader.tool=openocd
PMM0632.bootloader.tool.default=openocd
PMM0632.bootloader.file=zero/samd21_sam_ba.bin

# PMM0632X (SI 16x Analog Inputs)
# --------------------------------------
PMM0632X.name=PMM0632X (SI 16 x Analog input-IEC)
PMM0632X.vid.0=0x2341
PMM0632X.pid.0=0x804d
PMM0632X.vid.1=0x2341
PMM0632X.pid.1=0x004d
PMM0632X.vid.2=0x2341
PMM0632X.pid.2=0x824d
PMM0632X.vid.3=0x2341
PMM0632X.pid.3=0x024d
PMM0632X.upload_port.0.vid=0x2341
PMM0632X.upload_port.0.pid=0x804d
PMM0632X.upload_port.1.vid=0x2341
PMM0632X.upload_port.1.pid=0x004d
PMM0632X.upload_port.2.vid=0x2341
PMM0632X.upload_port.2.pid=0x824d
PMM0632X.upload_port.3.vid=0x2341
PMM0632X.upload_port.3.pid=0x024d
PMM0632X.upload_port.4.board=arduino_zero_native
PMM0632X.build.usb_product="PMM0632X"
PMM0632X.upload.tool=bossac
PMM0632X.upload.tool.default=bossac
PMM0632X.upload.tool.network=arduino_ota
PMM0632X.upload.protocol=sam-ba
PMM0632X.upload.maximum_size=32768
PMM0632X.upload.maximum_data_size=4096
PMM0632X.upload.use_1200bps_touch=true
PMM0632X.upload.wait_for_upload_port=true
PMM0632X.upload.native_usb=true
PMM0632X.build.mcu=cortex-m0plus
PMM0632X.build.f_cpu=48000000L
PMM0632X.build.usb_product="pmm0632X"
PMM0632X.build.usb_manufacturer="PMM LLC"
PMM0632X.build.board=pmm0632X
PMM0632X.build.core=arduino
PMM0632X.build.extra_flags=-D__SAMD21J15B__ {build.usb_flags}
PMM0632X.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0632X.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0632X.build.variant=pmm0632X
PMM0632X.build.variant_system_lib=
PMM0632X.build.vid=0x2341
PMM0632X.build.pid=0x804d
PMM0632X.bootloader.tool=openocd
PMM0632X.bootloader.tool.default=openocd
PMM0632X.bootloader.file=zero15b/samd21_sam_ba.bin

# PMM0632XP (SI 24x Analog Inputs)
# --------------------------------------
PMM0632XP.name=PMM0632XP (SI 24 x Analog Input-IEC)
PMM0632XP.vid.0=0x2341
PMM0632XP.pid.0=0x804d
PMM0632XP.vid.1=0x2341
PMM0632XP.pid.1=0x004d
PMM0632XP.vid.2=0x2341
PMM0632XP.pid.2=0x824d
PMM0632XP.vid.3=0x2341
PMM0632XP.pid.3=0x024d
PMM0632XP.upload_port.0.vid=0x2341
PMM0632XP.upload_port.0.pid=0x804d
PMM0632XP.upload_port.1.vid=0x2341
PMM0632XP.upload_port.1.pid=0x004d
PMM0632XP.upload_port.2.vid=0x2341
PMM0632XP.upload_port.2.pid=0x824d
PMM0632XP.upload_port.3.vid=0x2341
PMM0632XP.upload_port.3.pid=0x024d
PMM0632XP.upload_port.4.board=arduino_zero_native
PMM0632XP.build.usb_product="PMM0632XP"
PMM0632XP.upload.tool=bossac
PMM0632XP.upload.tool.default=bossac
PMM0632XP.upload.tool.network=arduino_ota
PMM0632XP.upload.protocol=sam-ba
PMM0632XP.upload.maximum_size=32768
PMM0632XP.upload.maximum_data_size=4096
PMM0632XP.upload.use_1200bps_touch=true
PMM0632XP.upload.wait_for_upload_port=true
PMM0632XP.upload.native_usb=true
PMM0632XP.build.mcu=cortex-m0plus
PMM0632XP.build.f_cpu=48000000L
PMM0632XP.build.usb_product="pmm0632XP"
PMM0632XP.build.usb_manufacturer="PMM LLC"
PMM0632XP.build.board=pmm0632XP
PMM0632XP.build.core=arduino
PMM0632XP.build.extra_flags=-D__SAMD21J15B__ {build.usb_flags}
PMM0632XP.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0632XP.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0632XP.build.variant=pmm0632XP
PMM0632XP.build.variant_system_lib=
PMM0632XP.build.vid=0x2341
PMM0632XP.build.pid=0x804d
PMM0632XP.bootloader.tool=openocd
PMM0632XP.bootloader.tool.default=openocd
PMM0632XP.bootloader.file=zero15b/samd21_sam_ba.bin

# PMM0635 (ESI 8x Analog Inputs)
# --------------------------------------
PMM0635.name=PMM0635 (ESI 8x Analog Inputs)
PMM0635.vid.0=0x2341
PMM0635.pid.0=0x804d
PMM0635.vid.1=0x2341
PMM0635.pid.1=0x004d
PMM0635.vid.2=0x2341
PMM0635.pid.2=0x824d
PMM0635.vid.3=0x2341
PMM0635.pid.3=0x024d
PMM0635.upload_port.0.vid=0x2341
PMM0635.upload_port.0.pid=0x804d
PMM0635.upload_port.1.vid=0x2341
PMM0635.upload_port.1.pid=0x004d
PMM0635.upload_port.2.vid=0x2341
PMM0635.upload_port.2.pid=0x824d
PMM0635.upload_port.3.vid=0x2341
PMM0635.upload_port.3.pid=0x024d
PMM0635.upload_port.4.board=arduino_zero_native
PMM0635.build.usb_product="PMM0635"
PMM0635.upload.tool=bossac
PMM0635.upload.tool.default=bossac
PMM0635.upload.tool.network=arduino_ota
PMM0635.upload.protocol=sam-ba
PMM0635.upload.maximum_size=262144
PMM0635.upload.maximum_data_size=32768
PMM0635.upload.use_1200bps_touch=true
PMM0635.upload.wait_for_upload_port=true
PMM0635.upload.native_usb=true
PMM0635.build.mcu=cortex-m0plus
PMM0635.build.f_cpu=48000000L
PMM0635.build.usb_product="pmm0635"
PMM0635.build.usb_manufacturer="PMM LLC"
PMM0635.build.board=pmm0635
PMM0635.build.core=arduino
PMM0635.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0635.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0635.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0635.build.variant=pmm0635
PMM0635.build.variant_system_lib=
PMM0635.build.vid=0x2341
PMM0635.build.pid=0x804d
PMM0635.bootloader.tool=openocd
PMM0635.bootloader.tool.default=openocd
PMM0635.bootloader.file=zero/samd21_sam_ba.bin

# PMM0635XP (SI 24x Analog Outputs)
# --------------------------------------
PMM0635XP.name=PMM0635XP (SI 24 x Analog Output-IEC)
PMM0635XP.vid.0=0x2341
PMM0635XP.pid.0=0x804d
PMM0635XP.vid.1=0x2341
PMM0635XP.pid.1=0x004d
PMM0635XP.vid.2=0x2341
PMM0635XP.pid.2=0x824d
PMM0635XP.vid.3=0x2341
PMM0635XP.pid.3=0x024d
PMM0635XP.upload_port.0.vid=0x2341
PMM0635XP.upload_port.0.pid=0x804d
PMM0635XP.upload_port.1.vid=0x2341
PMM0635XP.upload_port.1.pid=0x004d
PMM0635XP.upload_port.2.vid=0x2341
PMM0635XP.upload_port.2.pid=0x824d
PMM0635XP.upload_port.3.vid=0x2341
PMM0635XP.upload_port.3.pid=0x024d
PMM0635XP.upload_port.4.board=arduino_zero_native
PMM0635XP.build.usb_product="PMM0635XP"
PMM0635XP.upload.tool=bossac
PMM0635XP.upload.tool.default=bossac
PMM0635XP.upload.tool.network=arduino_ota
PMM0635XP.upload.protocol=sam-ba
PMM0635XP.upload.maximum_size=32768
PMM0635XP.upload.maximum_data_size=4096
PMM0635XP.upload.use_1200bps_touch=true
PMM0635XP.upload.wait_for_upload_port=true
PMM0635XP.upload.native_usb=true
PMM0635XP.build.mcu=cortex-m0plus
PMM0635XP.build.f_cpu=48000000L
PMM0635XP.build.usb_product="pmm0635XP"
PMM0635XP.build.usb_manufacturer="PMM LLC"
PMM0635XP.build.board=pmm0635XP
PMM0635XP.build.core=arduino
PMM0635XP.build.extra_flags=-D__SAMD21J15B__ {build.usb_flags}
PMM0635XP.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0635XP.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0635XP.build.variant=pmm0635XP
PMM0635XP.build.variant_system_lib=
PMM0635XP.build.vid=0x2341
PMM0635XP.build.pid=0x804d
PMM0635XP.bootloader.tool=openocd
PMM0635XP.bootloader.tool.default=openocd
PMM0635XP.bootloader.file=zero15b/samd21_sam_ba.bin

# PMM0636 (ESI 4x Analog Outputs)
# --------------------------------------
PMM0636.name=PMM0636 (ESI 4x Analog Outputs)
PMM0636.vid.0=0x2341
PMM0636.pid.0=0x804d
PMM0636.vid.1=0x2341
PMM0636.pid.1=0x004d
PMM0636.vid.2=0x2341
PMM0636.pid.2=0x824d
PMM0636.vid.3=0x2341
PMM0636.pid.3=0x024d
PMM0636.upload_port.0.vid=0x2341
PMM0636.upload_port.0.pid=0x804d
PMM0636.upload_port.1.vid=0x2341
PMM0636.upload_port.1.pid=0x004d
PMM0636.upload_port.2.vid=0x2341
PMM0636.upload_port.2.pid=0x824d
PMM0636.upload_port.3.vid=0x2341
PMM0636.upload_port.3.pid=0x024d
PMM0636.upload_port.4.board=arduino_zero_native
PMM0636.build.usb_product="PMM0636"
PMM0636.upload.tool=bossac
PMM0636.upload.tool.default=bossac
PMM0636.upload.tool.network=arduino_ota
PMM0636.upload.protocol=sam-ba
PMM0636.upload.maximum_size=262144
PMM0636.upload.maximum_data_size=32768
PMM0636.upload.use_1200bps_touch=true
PMM0636.upload.wait_for_upload_port=true
PMM0636.upload.native_usb=true
PMM0636.build.mcu=cortex-m0plus
PMM0636.build.f_cpu=48000000L
PMM0636.build.usb_product="pmm0636"
PMM0636.build.usb_manufacturer="PMM LLC"
PMM0636.build.board=pmm0636
PMM0636.build.core=arduino
PMM0636.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0636.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0636.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0636.build.variant=pmm0636
PMM0636.build.variant_system_lib=
PMM0636.build.vid=0x2341
PMM0636.build.pid=0x804d
PMM0636.bootloader.tool=openocd
PMM0636.bootloader.tool.default=openocd
PMM0636.bootloader.file=zero/samd21_sam_ba.bin

# PMM0638 (ESI 8x Analog Input Output)
# --------------------------------------
PMM0638.name=PMM0638 (ESI 8x Analog Input Output)
PMM0638.vid.0=0x2341
PMM0638.pid.0=0x804d
PMM0638.vid.1=0x2341
PMM0638.pid.1=0x004d
PMM0638.vid.2=0x2341
PMM0638.pid.2=0x824d
PMM0638.vid.3=0x2341
PMM0638.pid.3=0x024d
PMM0638.upload_port.0.vid=0x2341
PMM0638.upload_port.0.pid=0x804d
PMM0638.upload_port.1.vid=0x2341
PMM0638.upload_port.1.pid=0x004d
PMM0638.upload_port.2.vid=0x2341
PMM0638.upload_port.2.pid=0x824d
PMM0638.upload_port.3.vid=0x2341
PMM0638.upload_port.3.pid=0x024d
PMM0638.upload_port.4.board=arduino_zero_native
PMM0638.build.usb_product="PMM0638"
PMM0638.upload.tool=bossac
PMM0638.upload.tool.default=bossac
PMM0638.upload.tool.network=arduino_ota
PMM0638.upload.protocol=sam-ba
PMM0638.upload.maximum_size=262144
PMM0638.upload.maximum_data_size=32768
PMM0638.upload.use_1200bps_touch=true
PMM0638.upload.wait_for_upload_port=true
PMM0638.upload.native_usb=true
PMM0638.build.mcu=cortex-m0plus
PMM0638.build.f_cpu=48000000L
PMM0638.build.usb_product="pmm0638"
PMM0638.build.usb_manufacturer="PMM LLC"
PMM0638.build.board=pmm0638
PMM0638.build.core=arduino
PMM0638.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0638.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0638.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0638.build.variant=pmm0638
PMM0638.build.variant_system_lib=
PMM0638.build.vid=0x2341
PMM0638.build.pid=0x804d
PMM0638.bootloader.tool=openocd
PMM0638.bootloader.tool.default=openocd
PMM0638.bootloader.file=zero/samd21_sam_ba.bin

# PMM0638XP (SI 12 x Analog Inputs + 12 x Analog Outputs)
# --------------------------------------
PMM0638XP.name=PMM0638XP (SI 12 x Analog Input + 12 x Analog Output -IEC)
PMM0638XP.vid.0=0x2341
PMM0638XP.pid.0=0x804d
PMM0638XP.vid.1=0x2341
PMM0638XP.pid.1=0x004d
PMM0638XP.vid.2=0x2341
PMM0638XP.pid.2=0x824d
PMM0638XP.vid.3=0x2341
PMM0638XP.pid.3=0x024d
PMM0638XP.upload_port.0.vid=0x2341
PMM0638XP.upload_port.0.pid=0x804d
PMM0638XP.upload_port.1.vid=0x2341
PMM0638XP.upload_port.1.pid=0x004d
PMM0638XP.upload_port.2.vid=0x2341
PMM0638XP.upload_port.2.pid=0x824d
PMM0638XP.upload_port.3.vid=0x2341
PMM0638XP.upload_port.3.pid=0x024d
PMM0638XP.upload_port.4.board=arduino_zero_native
PMM0638XP.build.usb_product="PMM0638XP"
PMM0638XP.upload.tool=bossac
PMM0638XP.upload.tool.default=bossac
PMM0638XP.upload.tool.network=arduino_ota
PMM0638XP.upload.protocol=sam-ba
PMM0638XP.upload.maximum_size=32768
PMM0638XP.upload.maximum_data_size=4096
PMM0638XP.upload.use_1200bps_touch=true
PMM0638XP.upload.wait_for_upload_port=true
PMM0638XP.upload.native_usb=true
PMM0638XP.build.mcu=cortex-m0plus
PMM0638XP.build.f_cpu=48000000L
PMM0638XP.build.usb_product="pmm0638XP"
PMM0638XP.build.usb_manufacturer="PMM LLC"
PMM0638XP.build.board=pmm0638XP
PMM0638XP.build.core=arduino
PMM0638XP.build.extra_flags=-D__SAMD21J15B__ {build.usb_flags}
PMM0638XP.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0638XP.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0638XP.build.variant=pmm0638XP
PMM0638XP.build.variant_system_lib=
PMM0638XP.build.vid=0x2341
PMM0638XP.build.pid=0x804d
PMM0638XP.bootloader.tool=openocd
PMM0638XP.bootloader.tool.default=openocd
PMM0638XP.bootloader.file=zero15b/samd21_sam_ba.bin


