Israr-Engineering/PMM-11XX-RENEWABLE/custom_Board/1.8.13/boards.txt
# PMM0639 (ESI 4xAnalog Input Output + Digital Input Output)
# --------------------------------------
PMM0639.name=PMM0639 (ESI 4xAnalog Input Output + Digital Input Output)
PMM0639.vid.0=0x2341
PMM0639.pid.0=0x804d
PMM0639.vid.1=0x2341
PMM0639.pid.1=0x004d
PMM0639.vid.2=0x2341
PMM0639.pid.2=0x824d
PMM0639.vid.3=0x2341
PMM0639.pid.3=0x024d
PMM0639.upload_port.0.vid=0x2341
PMM0639.upload_port.0.pid=0x804d
PMM0639.upload_port.1.vid=0x2341
PMM0639.upload_port.1.pid=0x004d
PMM0639.upload_port.2.vid=0x2341
PMM0639.upload_port.2.pid=0x824d
PMM0639.upload_port.3.vid=0x2341
PMM0639.upload_port.3.pid=0x024d
PMM0639.upload_port.4.board=arduino_zero_native
PMM0639.build.usb_product="PMM0639"
PMM0639.upload.tool=bossac
PMM0639.upload.tool.default=bossac
PMM0639.upload.tool.network=arduino_ota
PMM0639.upload.protocol=sam-ba
PMM0639.upload.maximum_size=262144
PMM0639.upload.maximum_data_size=32768
PMM0639.upload.use_1200bps_touch=true
PMM0639.upload.wait_for_upload_port=true
PMM0639.upload.native_usb=true
PMM0639.build.mcu=cortex-m0plus
PMM0639.build.f_cpu=48000000L
PMM0639.build.usb_product="pmm0639"
PMM0639.build.usb_manufacturer="PMM LLC"
PMM0639.build.board=pmm0639
PMM0639.build.core=arduino
PMM0639.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0639.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0639.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0639.build.variant=pmm0639
PMM0639.build.variant_system_lib=
PMM0639.build.vid=0x2341
PMM0639.build.pid=0x804d
PMM0639.bootloader.tool=openocd
PMM0639.bootloader.tool.default=openocd
PMM0639.bootloader.file=zero/samd21_sam_ba.bin

# PMM0639XP (SI 12x Digital Inputs + 6x Digital Outputs + 4x Analog Inputs + 2x Analog Outputs)
# --------------------------------------
PMM0639XP.name=PMM0639XP (SI 12x Digital Input + 6x Digital Output + 4x Analog Input + 2x Analog Output-IEC)
PMM0639XP.vid.0=0x2341
PMM0639XP.pid.0=0x804d
PMM0639XP.vid.1=0x2341
PMM0639XP.pid.1=0x004d
PMM0639XP.vid.2=0x2341
PMM0639XP.pid.2=0x824d
PMM0639XP.vid.3=0x2341
PMM0639XP.pid.3=0x024d
PMM0639XP.upload_port.0.vid=0x2341
PMM0639XP.upload_port.0.pid=0x804d
PMM0639XP.upload_port.1.vid=0x2341
PMM0639XP.upload_port.1.pid=0x004d
PMM0639XP.upload_port.2.vid=0x2341
PMM0639XP.upload_port.2.pid=0x824d
PMM0639XP.upload_port.3.vid=0x2341
PMM0639XP.upload_port.3.pid=0x024d
PMM0639XP.upload_port.4.board=arduino_zero_native
PMM0639XP.build.usb_product="PMM0639XP"
PMM0639XP.upload.tool=bossac
PMM0639XP.upload.tool.default=bossac
PMM0639XP.upload.tool.network=arduino_ota
PMM0639XP.upload.protocol=sam-ba
PMM0639XP.upload.maximum_size=32768
PMM0639XP.upload.maximum_data_size=4096
PMM0639XP.upload.use_1200bps_touch=true
PMM0639XP.upload.wait_for_upload_port=true
PMM0639XP.upload.native_usb=true
PMM0639XP.build.mcu=cortex-m0plus
PMM0639XP.build.f_cpu=48000000L
PMM0639XP.build.usb_product="pmm0639XP"
PMM0639XP.build.usb_manufacturer="PMM LLC"
PMM0639XP.build.board=pmm0639XP
PMM0639XP.build.core=arduino
PMM0639XP.build.extra_flags=-D__SAMD21J15B__ {build.usb_flags}
PMM0639XP.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
PMM0639XP.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0639XP.build.variant=pmm0639XP
PMM0639XP.build.variant_system_lib=
PMM0639XP.build.vid=0x2341
PMM0639XP.build.pid=0x804d
PMM0639XP.bootloader.tool=openocd
PMM0639XP.bootloader.tool.default=openocd
PMM0639XP.bootloader.file=zero15b/samd21_sam_ba.bin

# PMM0640 (ESI 1PH Energy Meter)
# --------------------------------------
PMM0640.name=PMM0640 (ESI 1PH Energy Meter)
PMM0640.vid.0=0x2341
PMM0640.pid.0=0x804d
PMM0640.vid.1=0x2341
PMM0640.pid.1=0x004d
PMM0640.vid.2=0x2341
PMM0640.pid.2=0x824d
PMM0640.vid.3=0x2341
PMM0640.pid.3=0x024d
PMM0640.upload_port.0.vid=0x2341
PMM0640.upload_port.0.pid=0x804d
PMM0640.upload_port.1.vid=0x2341
PMM0640.upload_port.1.pid=0x004d
PMM0640.upload_port.2.vid=0x2341
PMM0640.upload_port.2.pid=0x824d
PMM0640.upload_port.3.vid=0x2341
PMM0640.upload_port.3.pid=0x024d
PMM0640.upload_port.4.board=arduino_zero_native
PMM0640.build.usb_product="PMM0640"
PMM0640.upload.tool=bossac
PMM0640.upload.tool.default=bossac
PMM0640.upload.tool.network=arduino_ota
PMM0640.upload.protocol=sam-ba
PMM0640.upload.maximum_size=262144
PMM0640.upload.maximum_data_size=32768
PMM0640.upload.use_1200bps_touch=true
PMM0640.upload.wait_for_upload_port=true
PMM0640.upload.native_usb=true
PMM0640.build.mcu=cortex-m0plus
PMM0640.build.f_cpu=48000000L
PMM0640.build.usb_product="pmm0640"
PMM0640.build.usb_manufacturer="PMM LLC"
PMM0640.build.board=pmm0640
PMM0640.build.core=arduino
PMM0640.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0640.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0640.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0640.build.variant=pmm0640
PMM0640.build.variant_system_lib=
PMM0640.build.vid=0x2341
PMM0640.build.pid=0x804d
PMM0640.bootloader.tool=openocd
PMM0640.bootloader.tool.default=openocd
PMM0640.bootloader.file=zero/samd21_sam_ba.bin

# PMM0641 (ESI 3PH Energy Meter)
# --------------------------------------
PMM0641.name=PMM0641 (ESI 3PH Energy Meter)
PMM0641.vid.0=0x2341
PMM0641.pid.0=0x804d
PMM0641.vid.1=0x2341
PMM0641.pid.1=0x004d
PMM0641.vid.2=0x2341
PMM0641.pid.2=0x824d
PMM0641.vid.3=0x2341
PMM0641.pid.3=0x024d
PMM0641.upload_port.0.vid=0x2341
PMM0641.upload_port.0.pid=0x804d
PMM0641.upload_port.1.vid=0x2341
PMM0641.upload_port.1.pid=0x004d
PMM0641.upload_port.2.vid=0x2341
PMM0641.upload_port.2.pid=0x824d
PMM0641.upload_port.3.vid=0x2341
PMM0641.upload_port.3.pid=0x024d
PMM0641.upload_port.4.board=arduino_zero_native
PMM0641.build.usb_product="PMM0641"
PMM0641.upload.tool=bossac
PMM0641.upload.tool.default=bossac
PMM0641.upload.tool.network=arduino_ota
PMM0641.upload.protocol=sam-ba
PMM0641.upload.maximum_size=262144
PMM0641.upload.maximum_data_size=32768
PMM0641.upload.use_1200bps_touch=true
PMM0641.upload.wait_for_upload_port=true
PMM0641.upload.native_usb=true
PMM0641.build.mcu=cortex-m0plus
PMM0641.build.f_cpu=48000000L
PMM0641.build.usb_product="pmm0641"
PMM0641.build.usb_manufacturer="PMM LLC"
PMM0641.build.board=pmm0640
PMM0641.build.core=arduino
PMM0641.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0641.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0641.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0641.build.variant=pmm0641
PMM0641.build.variant_system_lib=
PMM0641.build.vid=0x2341
PMM0641.build.pid=0x804d
PMM0641.bootloader.tool=openocd
PMM0641.bootloader.tool.default=openocd
PMM0641.bootloader.file=zero/samd21_sam_ba.bin

# PMM0650 (ESI Temperature and humidity Controller)
# --------------------------------------
PMM0650.name=PMM0650 (ESI Temperature and humidity Controller)
PMM0650.vid.0=0x2341
PMM0650.pid.0=0x804d
PMM0650.vid.1=0x2341
PMM0650.pid.1=0x004d
PMM0650.vid.2=0x2341
PMM0650.pid.2=0x824d
PMM0650.vid.3=0x2341
PMM0650.pid.3=0x024d
PMM0650.upload_port.0.vid=0x2341
PMM0650.upload_port.0.pid=0x804d
PMM0650.upload_port.1.vid=0x2341
PMM0650.upload_port.1.pid=0x004d
PMM0650.upload_port.2.vid=0x2341
PMM0650.upload_port.2.pid=0x824d
PMM0650.upload_port.3.vid=0x2341
PMM0650.upload_port.3.pid=0x024d
PMM0650.upload_port.4.board=arduino_zero_native
PMM0650.build.usb_product="PMM0650"
PMM0650.upload.tool=bossac
PMM0650.upload.tool.default=bossac
PMM0650.upload.tool.network=arduino_ota
PMM0650.upload.protocol=sam-ba
PMM0650.upload.maximum_size=262144
PMM0650.upload.maximum_data_size=32768
PMM0650.upload.use_1200bps_touch=true
PMM0650.upload.wait_for_upload_port=true
PMM0650.upload.native_usb=true
PMM0650.build.mcu=cortex-m0plus
PMM0650.build.f_cpu=48000000L
PMM0650.build.usb_product="pmm0650"
PMM0650.build.usb_manufacturer="PMM LLC"
PMM0650.build.board=pmm0650
PMM0650.build.core=arduino
PMM0650.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0650.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0650.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0650.build.variant=pmm0650
PMM0650.build.variant_system_lib=
PMM0650.build.vid=0x2341
PMM0650.build.pid=0x804d
PMM0650.bootloader.tool=openocd
PMM0650.bootloader.tool.default=openocd
PMM0650.bootloader.file=zero/samd21_sam_ba.bin

