Israr-Engineering/PMM-11XX-RENEWABLE/custom_Board/1.8.13/boards.txt
# PMM0651 (ESI Fan Speed Controller)
# --------------------------------------
PMM0651.name=PMM0651 (ESI Fan Speed Controller)
PMM0651.vid.0=0x2341
PMM0651.pid.0=0x804d
PMM0651.vid.1=0x2341
PMM0651.pid.1=0x004d
PMM0651.vid.2=0x2341
PMM0651.pid.2=0x824d
PMM0651.vid.3=0x2341
PMM0651.pid.3=0x024d
PMM0651.upload_port.0.vid=0x2341
PMM0651.upload_port.0.pid=0x804d
PMM0651.upload_port.1.vid=0x2341
PMM0651.upload_port.1.pid=0x004d
PMM0651.upload_port.2.vid=0x2341
PMM0651.upload_port.2.pid=0x824d
PMM0651.upload_port.3.vid=0x2341
PMM0651.upload_port.3.pid=0x024d
PMM0651.upload_port.4.board=arduino_zero_native
PMM0651.build.usb_product="PMM0651"
PMM0651.upload.tool=bossac
PMM0651.upload.tool.default=bossac
PMM0651.upload.tool.network=arduino_ota
PMM0651.upload.protocol=sam-ba
PMM0651.upload.maximum_size=262144
PMM0651.upload.maximum_data_size=32768
PMM0651.upload.use_1200bps_touch=true
PMM0651.upload.wait_for_upload_port=true
PMM0651.upload.native_usb=true
PMM0651.build.mcu=cortex-m0plus
PMM0651.build.f_cpu=48000000L
PMM0651.build.usb_product="pmm0651"
PMM0651.build.usb_manufacturer="PMM LLC"
PMM0651.build.board=pmm0651
PMM0651.build.core=arduino
PMM0651.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0651.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0651.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0651.build.variant=pmm0651
PMM0651.build.variant_system_lib=
PMM0651.build.vid=0x2341
PMM0651.build.pid=0x804d
PMM0651.bootloader.tool=openocd
PMM0651.bootloader.tool.default=openocd
PMM0651.bootloader.file=zero/samd21_sam_ba.bin

# PMM0660 (ESI Pressure Controller)
# --------------------------------------
PMM0660.name=PMM0660 (ESI Pressure Controller)
PMM0660.vid.0=0x2341
PMM0660.pid.0=0x804d
PMM0660.vid.1=0x2341
PMM0660.pid.1=0x004d
PMM0660.vid.2=0x2341
PMM0660.pid.2=0x824d
PMM0660.vid.3=0x2341
PMM0660.pid.3=0x024d
PMM0660.upload_port.0.vid=0x2341
PMM0660.upload_port.0.pid=0x804d
PMM0660.upload_port.1.vid=0x2341
PMM0660.upload_port.1.pid=0x004d
PMM0660.upload_port.2.vid=0x2341
PMM0660.upload_port.2.pid=0x824d
PMM0660.upload_port.3.vid=0x2341
PMM0660.upload_port.3.pid=0x024d
PMM0660.upload_port.4.board=arduino_zero_native
PMM0660.build.usb_product="PMM0660"
PMM0660.upload.tool=bossac
PMM0660.upload.tool.default=bossac
PMM0660.upload.tool.network=arduino_ota
PMM0660.upload.protocol=sam-ba
PMM0660.upload.maximum_size=262144
PMM0660.upload.maximum_data_size=32768
PMM0660.upload.use_1200bps_touch=true
PMM0660.upload.wait_for_upload_port=true
PMM0660.upload.native_usb=true
PMM0660.build.mcu=cortex-m0plus
PMM0660.build.f_cpu=48000000L
PMM0660.build.usb_product="pmm0660"
PMM0660.build.usb_manufacturer="PMM LLC"
PMM0660.build.board=pmm0660
PMM0660.build.core=arduino
PMM0660.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0660.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0660.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0660.build.variant=pmm0660
PMM0660.build.variant_system_lib=
PMM0660.build.vid=0x2341
PMM0660.build.pid=0x804d
PMM0660.bootloader.tool=openocd
PMM0660.bootloader.tool.default=openocd
PMM0660.bootloader.file=zero/samd21_sam_ba.bin

# PMM0661 (ESI Flow Controller)
# --------------------------------------
PMM0661.name=PMM0661 (ESI Flow Controller)
PMM0661.vid.0=0x2341
PMM0661.pid.0=0x804d
PMM0661.vid.1=0x2341
PMM0661.pid.1=0x004d
PMM0661.vid.2=0x2341
PMM0661.pid.2=0x824d
PMM0661.vid.3=0x2341
PMM0661.pid.3=0x024d
PMM0661.upload_port.0.vid=0x2341
PMM0661.upload_port.0.pid=0x804d
PMM0661.upload_port.1.vid=0x2341
PMM0661.upload_port.1.pid=0x004d
PMM0661.upload_port.2.vid=0x2341
PMM0661.upload_port.2.pid=0x824d
PMM0661.upload_port.3.vid=0x2341
PMM0661.upload_port.3.pid=0x024d
PMM0661.upload_port.4.board=arduino_zero_native
PMM0661.build.usb_product="PMM0661"
PMM0661.upload.tool=bossac
PMM0661.upload.tool.default=bossac
PMM0661.upload.tool.network=arduino_ota
PMM0661.upload.protocol=sam-ba
PMM0661.upload.maximum_size=262144
PMM0661.upload.maximum_data_size=32768
PMM0661.upload.use_1200bps_touch=true
PMM0661.upload.wait_for_upload_port=true
PMM0661.upload.native_usb=true
PMM0661.build.mcu=cortex-m0plus
PMM0661.build.f_cpu=48000000L
PMM0661.build.usb_product="pmm0661"
PMM0661.build.usb_manufacturer="PMM LLC"
PMM0661.build.board=pmm0661
PMM0661.build.core=arduino
PMM0661.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0661.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0661.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0661.build.variant=pmm0661
PMM0661.build.variant_system_lib=
PMM0661.build.vid=0x2341
PMM0661.build.pid=0x804d
PMM0661.bootloader.tool=openocd
PMM0661.bootloader.tool.default=openocd
PMM0661.bootloader.file=zero/samd21_sam_ba.bin

# PMM0662 (ESI Tank Level Controller)
# --------------------------------------
PMM0662.name=PMM0662 (ESI Tank Level Controller)
PMM0662.vid.0=0x2341
PMM0662.pid.0=0x804d
PMM0662.vid.1=0x2341
PMM0662.pid.1=0x004d
PMM0662.vid.2=0x2341
PMM0662.pid.2=0x824d
PMM0662.vid.3=0x2341
PMM0662.pid.3=0x024d
PMM0662.upload_port.0.vid=0x2341
PMM0662.upload_port.0.pid=0x804d
PMM0662.upload_port.1.vid=0x2341
PMM0662.upload_port.1.pid=0x004d
PMM0662.upload_port.2.vid=0x2341
PMM0662.upload_port.2.pid=0x824d
PMM0662.upload_port.3.vid=0x2341
PMM0662.upload_port.3.pid=0x024d
PMM0662.upload_port.4.board=arduino_zero_native
PMM0662.build.usb_product="PMM0662"
PMM0662.upload.tool=bossac
PMM0662.upload.tool.default=bossac
PMM0662.upload.tool.network=arduino_ota
PMM0662.upload.protocol=sam-ba
PMM0662.upload.maximum_size=262144
PMM0662.upload.maximum_data_size=32768
PMM0662.upload.use_1200bps_touch=true
PMM0662.upload.wait_for_upload_port=true
PMM0662.upload.native_usb=true
PMM0662.build.mcu=cortex-m0plus
PMM0662.build.f_cpu=48000000L
PMM0662.build.usb_product="pmm0662"
PMM0662.build.usb_manufacturer="PMM LLC"
PMM0662.build.board=pmm0662
PMM0662.build.core=arduino
PMM0662.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0662.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0662.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0662.build.variant=pmm0662
PMM0662.build.variant_system_lib=
PMM0662.build.vid=0x2341
PMM0662.build.pid=0x804d
PMM0662.bootloader.tool=openocd
PMM0662.bootloader.tool.default=openocd
PMM0662.bootloader.file=zero/samd21_sam_ba.bin

# PMM0663 (ESI Pump Start-Stop Controller)
# --------------------------------------
PMM0663.name=PMM0663 (ESI Pump Start-Stop Controller)
PMM0663.vid.0=0x2341
PMM0663.pid.0=0x804d
PMM0663.vid.1=0x2341
PMM0663.pid.1=0x004d
PMM0663.vid.2=0x2341
PMM0663.pid.2=0x824d
PMM0663.vid.3=0x2341
PMM0663.pid.3=0x024d
PMM0663.upload_port.0.vid=0x2341
PMM0663.upload_port.0.pid=0x804d
PMM0663.upload_port.1.vid=0x2341
PMM0663.upload_port.1.pid=0x004d
PMM0663.upload_port.2.vid=0x2341
PMM0663.upload_port.2.pid=0x824d
PMM0663.upload_port.3.vid=0x2341
PMM0663.upload_port.3.pid=0x024d
PMM0663.upload_port.4.board=arduino_zero_native
PMM0663.build.usb_product="PMM0663"
PMM0663.upload.tool=bossac
PMM0663.upload.tool.default=bossac
PMM0663.upload.tool.network=arduino_ota
PMM0663.upload.protocol=sam-ba
PMM0663.upload.maximum_size=262144
PMM0663.upload.maximum_data_size=32768
PMM0663.upload.use_1200bps_touch=true
PMM0663.upload.wait_for_upload_port=true
PMM0663.upload.native_usb=true
PMM0663.build.mcu=cortex-m0plus
PMM0663.build.f_cpu=48000000L
PMM0663.build.usb_product="pmm0663"
PMM0663.build.usb_manufacturer="PMM LLC"
PMM0663.build.board=pmm0663
PMM0663.build.core=arduino
PMM0663.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0663.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0663.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0663.build.variant=pmm0663
PMM0663.build.variant_system_lib=
PMM0663.build.vid=0x2341
PMM0663.build.pid=0x804d
PMM0663.bootloader.tool=openocd
PMM0663.bootloader.tool.default=openocd
PMM0663.bootloader.file=zero/samd21_sam_ba.bin

# PMM0670 (ESI Single Axis Controller)
# --------------------------------------
PMM0670.name=PMM0670 (ESI Single Axis Controller)
PMM0670.vid.0=0x2341
PMM0670.pid.0=0x804d
PMM0670.vid.1=0x2341
PMM0670.pid.1=0x004d
PMM0670.vid.2=0x2341
PMM0670.pid.2=0x824d
PMM0670.vid.3=0x2341
PMM0670.pid.3=0x024d
PMM0670.upload_port.0.vid=0x2341
PMM0670.upload_port.0.pid=0x804d
PMM0670.upload_port.1.vid=0x2341
PMM0670.upload_port.1.pid=0x004d
PMM0670.upload_port.2.vid=0x2341
PMM0670.upload_port.2.pid=0x824d
PMM0670.upload_port.3.vid=0x2341
PMM0670.upload_port.3.pid=0x024d
PMM0670.upload_port.4.board=arduino_zero_native
PMM0670.build.usb_product="PMM0670"
PMM0670.upload.tool=bossac
PMM0670.upload.tool.default=bossac
PMM0670.upload.tool.network=arduino_ota
PMM0670.upload.protocol=sam-ba
PMM0670.upload.maximum_size=262144
PMM0670.upload.maximum_data_size=32768
PMM0670.upload.use_1200bps_touch=true
PMM0670.upload.wait_for_upload_port=true
PMM0670.upload.native_usb=true
PMM0670.build.mcu=cortex-m0plus
PMM0670.build.f_cpu=48000000L
PMM0670.build.usb_product="pmm0670"
PMM0670.build.usb_manufacturer="PMM LLC"
PMM0670.build.board=pmm0670
PMM0670.build.core=arduino
PMM0670.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0670.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0670.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0670.build.variant=pmm0670
PMM0670.build.variant_system_lib=
PMM0670.build.vid=0x2341
PMM0670.build.pid=0x804d
PMM0670.bootloader.tool=openocd
PMM0670.bootloader.tool.default=openocd
PMM0670.bootloader.file=zero/samd21_sam_ba.bin

# PMM0671 (ESI Flying Shear Controller)
# --------------------------------------
PMM0671.name=PMM0671 (ESI Flying Shear Controller)
PMM0671.vid.0=0x2341
PMM0671.pid.0=0x804d
PMM0671.vid.1=0x2341
PMM0671.pid.1=0x004d
PMM0671.vid.2=0x2341
PMM0671.pid.2=0x824d
PMM0671.vid.3=0x2341
PMM0671.pid.3=0x024d
PMM0671.upload_port.0.vid=0x2341
PMM0671.upload_port.0.pid=0x804d
PMM0671.upload_port.1.vid=0x2341
PMM0671.upload_port.1.pid=0x004d
PMM0671.upload_port.2.vid=0x2341
PMM0671.upload_port.2.pid=0x824d
PMM0671.upload_port.3.vid=0x2341
PMM0671.upload_port.3.pid=0x024d
PMM0671.upload_port.4.board=arduino_zero_native
PMM0671.build.usb_product="PMM0671"
PMM0671.upload.tool=bossac
PMM0671.upload.tool.default=bossac
PMM0671.upload.tool.network=arduino_ota
PMM0671.upload.protocol=sam-ba
PMM0671.upload.maximum_size=262144
PMM0671.upload.maximum_data_size=32768
PMM0671.upload.use_1200bps_touch=true
PMM0671.upload.wait_for_upload_port=true
PMM0671.upload.native_usb=true
PMM0671.build.mcu=cortex-m0plus
PMM0671.build.f_cpu=48000000L
PMM0671.build.usb_product="pmm0671"
PMM0671.build.usb_manufacturer="PMM LLC"
PMM0671.build.board=pmm0671
PMM0671.build.core=arduino
PMM0671.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0671.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0671.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0671.build.variant=pmm0671
PMM0671.build.variant_system_lib=
PMM0671.build.vid=0x2341
PMM0671.build.pid=0x804d
PMM0671.bootloader.tool=openocd
PMM0671.bootloader.tool.default=openocd
PMM0671.bootloader.file=zero/samd21_sam_ba.bin

# PMM0672 (ESI Two Axies Controller)
# --------------------------------------
PMM0672.name=PMM0672 (ESI Two Axies Controller)
PMM0672.vid.0=0x2341
PMM0672.pid.0=0x804d
PMM0672.vid.1=0x2341
PMM0672.pid.1=0x004d
PMM0672.vid.2=0x2341
PMM0672.pid.2=0x824d
PMM0672.vid.3=0x2341
PMM0672.pid.3=0x024d
PMM0672.upload_port.0.vid=0x2341
PMM0672.upload_port.0.pid=0x804d
PMM0672.upload_port.1.vid=0x2341
PMM0672.upload_port.1.pid=0x004d
PMM0672.upload_port.2.vid=0x2341
PMM0672.upload_port.2.pid=0x824d
PMM0672.upload_port.3.vid=0x2341
PMM0672.upload_port.3.pid=0x024d
PMM0672.upload_port.4.board=arduino_zero_native
PMM0672.build.usb_product="PMM0672"
PMM0672.upload.tool=bossac
PMM0672.upload.tool.default=bossac
PMM0672.upload.tool.network=arduino_ota
PMM0672.upload.protocol=sam-ba
PMM0672.upload.maximum_size=262144
PMM0672.upload.maximum_data_size=32768
PMM0672.upload.use_1200bps_touch=true
PMM0672.upload.wait_for_upload_port=true
PMM0672.upload.native_usb=true
PMM0672.build.mcu=cortex-m0plus
PMM0672.build.f_cpu=48000000L
PMM0672.build.usb_product="pmm0672"
PMM0672.build.usb_manufacturer="PMM LLC"
PMM0672.build.board=pmm0672
PMM0672.build.core=arduino
PMM0672.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0672.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0672.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0672.build.variant=pmm0672
PMM0672.build.variant_system_lib=
PMM0672.build.vid=0x2341
PMM0672.build.pid=0x804d
PMM0672.bootloader.tool=openocd
PMM0672.bootloader.tool.default=openocd
PMM0672.bootloader.file=zero/samd21_sam_ba.bin

