Israr-Engineering/PMM-11XX-RENEWABLE/custom_Board/1.8.13/boards.txt
# PMM0673 (ESI Three Axies Controller)
# --------------------------------------
PMM0673.name=PMM0673 (ESI Three Axies Controller)
PMM0673.vid.0=0x2341
PMM0673.pid.0=0x804d
PMM0673.vid.1=0x2341
PMM0673.pid.1=0x004d
PMM0673.vid.2=0x2341
PMM0673.pid.2=0x824d
PMM0673.vid.3=0x2341
PMM0673.pid.3=0x024d
PMM0673.upload_port.0.vid=0x2341
PMM0673.upload_port.0.pid=0x804d
PMM0673.upload_port.1.vid=0x2341
PMM0673.upload_port.1.pid=0x004d
PMM0673.upload_port.2.vid=0x2341
PMM0673.upload_port.2.pid=0x824d
PMM0673.upload_port.3.vid=0x2341
PMM0673.upload_port.3.pid=0x024d
PMM0673.upload_port.4.board=arduino_zero_native
PMM0673.build.usb_product="PMM0673"
PMM0673.upload.tool=bossac
PMM0673.upload.tool.default=bossac
PMM0673.upload.tool.network=arduino_ota
PMM0673.upload.protocol=sam-ba
PMM0673.upload.maximum_size=262144
PMM0673.upload.maximum_data_size=32768
PMM0673.upload.use_1200bps_touch=true
PMM0673.upload.wait_for_upload_port=true
PMM0673.upload.native_usb=true
PMM0673.build.mcu=cortex-m0plus
PMM0673.build.f_cpu=48000000L
PMM0673.build.usb_product="pmm0673"
PMM0673.build.usb_manufacturer="PMM LLC"
PMM0673.build.board=pmm0673
PMM0673.build.core=arduino
PMM0673.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0673.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0673.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0673.build.variant=pmm0673
PMM0673.build.variant_system_lib=
PMM0673.build.vid=0x2341
PMM0673.build.pid=0x804d
PMM0673.bootloader.tool=openocd
PMM0673.bootloader.tool.default=openocd
PMM0673.bootloader.file=zero/samd21_sam_ba.bin

# PMM0674  (ESI Six Axies Controller)
# --------------------------------------
PMM0674.name=PMM0674 (ESI Six Axies Controller)
PMM0674.vid.0=0x2341
PMM0674.pid.0=0x804d
PMM0674.vid.1=0x2341
PMM0674.pid.1=0x004d
PMM0674.vid.2=0x2341
PMM0674.pid.2=0x824d
PMM0674.vid.3=0x2341
PMM0674.pid.3=0x024d
PMM0674.upload_port.0.vid=0x2341
PMM0674.upload_port.0.pid=0x804d
PMM0674.upload_port.1.vid=0x2341
PMM0674.upload_port.1.pid=0x004d
PMM0674.upload_port.2.vid=0x2341
PMM0674.upload_port.2.pid=0x824d
PMM0674.upload_port.3.vid=0x2341
PMM0674.upload_port.3.pid=0x024d
PMM0674.upload_port.4.board=arduino_zero_native
PMM0674.build.usb_product="PMM0674"
PMM0674.upload.tool=bossac
PMM0674.upload.tool.default=bossac
PMM0674.upload.tool.network=arduino_ota
PMM0674.upload.protocol=sam-ba
PMM0674.upload.maximum_size=262144
PMM0674.upload.maximum_data_size=32768
PMM0674.upload.use_1200bps_touch=true
PMM0674.upload.wait_for_upload_port=true
PMM0674.upload.native_usb=true
PMM0674.build.mcu=cortex-m0plus
PMM0674.build.f_cpu=48000000L
PMM0674.build.usb_product="PMM0674"
PMM0674.build.usb_manufacturer="PMM LLC"
PMM0674.build.board=pmm0674
PMM0674.build.core=arduino
PMM0674.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0674.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0674.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0674.build.variant=pmm0674
PMM0674.build.variant_system_lib=
PMM0674.build.vid=0x2341
PMM0674.build.pid=0x804d
PMM0674.bootloader.tool=openocd
PMM0674.bootloader.tool.default=openocd
PMM0674.bootloader.file=zero/samd21_sam_ba.bin

# PMM0675 (ESI 4x Basic Optical encoder interface)
# --------------------------------------
PMM0675.name=PMM0675 (ESI 4x Basic Optical encoder interface)
PMM0675.vid.0=0x2341
PMM0675.pid.0=0x804d
PMM0675.vid.1=0x2341
PMM0675.pid.1=0x004d
PMM0675.vid.2=0x2341
PMM0675.pid.2=0x824d
PMM0675.vid.3=0x2341
PMM0675.pid.3=0x024d
PMM0675.upload_port.0.vid=0x2341
PMM0675.upload_port.0.pid=0x804d
PMM0675.upload_port.1.vid=0x2341
PMM0675.upload_port.1.pid=0x004d
PMM0675.upload_port.2.vid=0x2341
PMM0675.upload_port.2.pid=0x824d
PMM0675.upload_port.3.vid=0x2341
PMM0675.upload_port.3.pid=0x024d
PMM0675.upload_port.4.board=arduino_zero_native
PMM0675.build.usb_product="PMM0675"
PMM0675.upload.tool=bossac
PMM0675.upload.tool.default=bossac
PMM0675.upload.tool.network=arduino_ota
PMM0675.upload.protocol=sam-ba
PMM0675.upload.maximum_size=262144
PMM0675.upload.maximum_data_size=32768
PMM0675.upload.use_1200bps_touch=true
PMM0675.upload.wait_for_upload_port=true
PMM0675.upload.native_usb=true
PMM0675.build.mcu=cortex-m0plus
PMM0675.build.f_cpu=48000000L
PMM0675.build.usb_product="PMM0675"
PMM0675.build.usb_manufacturer="PMM LLC"
PMM0675.build.board=pmm0675
PMM0675.build.core=arduino
PMM0675.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0675.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0675.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0675.build.variant=pmm0675
PMM0675.build.variant_system_lib=
PMM0675.build.vid=0x2341
PMM0675.build.pid=0x804d
PMM0675.bootloader.tool=openocd
PMM0675.bootloader.tool.default=openocd
PMM0675.bootloader.file=zero/samd21_sam_ba.bin

# PMM0676 (ESI Advanced Optical encoder interface)
# --------------------------------------
PMM0676.name=PMM0676 (ESI Advanced Optical encoder interface)
PMM0676.vid.0=0x2341
PMM0676.pid.0=0x804d
PMM0676.vid.1=0x2341
PMM0676.pid.1=0x004d
PMM0676.vid.2=0x2341
PMM0676.pid.2=0x824d
PMM0676.vid.3=0x2341
PMM0676.pid.3=0x024d
PMM0676.upload_port.0.vid=0x2341
PMM0676.upload_port.0.pid=0x804d
PMM0676.upload_port.1.vid=0x2341
PMM0676.upload_port.1.pid=0x004d
PMM0676.upload_port.2.vid=0x2341
PMM0676.upload_port.2.pid=0x824d
PMM0676.upload_port.3.vid=0x2341
PMM0676.upload_port.3.pid=0x024d
PMM0676.upload_port.4.board=arduino_zero_native
PMM0676.build.usb_product="PMM0676"
PMM0676.upload.tool=bossac
PMM0676.upload.tool.default=bossac
PMM0676.upload.tool.network=arduino_ota
PMM0676.upload.protocol=sam-ba
PMM0676.upload.maximum_size=262144
PMM0676.upload.maximum_data_size=32768
PMM0676.upload.use_1200bps_touch=true
PMM0676.upload.wait_for_upload_port=true
PMM0676.upload.native_usb=true
PMM0676.build.mcu=cortex-m0plus
PMM0676.build.f_cpu=48000000L
PMM0676.build.usb_product="pmm0676"
PMM0676.build.usb_manufacturer="PMM LLC"
PMM0676.build.board=pmm0676
PMM0676.build.core=arduino
PMM0676.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0676.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0676.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0676.build.variant=pmm0676
PMM0676.build.variant_system_lib=
PMM0676.build.vid=0x2341
PMM0676.build.pid=0x804d
PMM0676.bootloader.tool=openocd
PMM0676.bootloader.tool.default=openocd
PMM0676.bootloader.file=zero/samd21_sam_ba.bin

# PMM0680 (ESI Load Cell MODBUS TCP V1.2)
# --------------------------------------
PMM0680.name=PMM0680 (ESI Load Cell MODBUS TCP)
PMM0680.vid.0=0x2341
PMM0680.pid.0=0x804d
PMM0680.vid.1=0x2341
PMM0680.pid.1=0x004d
PMM0680.vid.2=0x2341
PMM0680.pid.2=0x824d
PMM0680.vid.3=0x2341
PMM0680.pid.3=0x024d
PMM0680.upload_port.0.vid=0x2341
PMM0680.upload_port.0.pid=0x804d
PMM0680.upload_port.1.vid=0x2341
PMM0680.upload_port.1.pid=0x004d
PMM0680.upload_port.2.vid=0x2341
PMM0680.upload_port.2.pid=0x824d
PMM0680.upload_port.3.vid=0x2341
PMM0680.upload_port.3.pid=0x024d
PMM0680.upload_port.4.board=arduino_zero_native
PMM0680.build.usb_product="PMM0680"
PMM0680.upload.tool=bossac
PMM0680.upload.tool.default=bossac
PMM0680.upload.tool.network=arduino_ota
PMM0680.upload.protocol=sam-ba
PMM0680.upload.maximum_size=262144
PMM0680.upload.maximum_data_size=32768
PMM0680.upload.use_1200bps_touch=true
PMM0680.upload.wait_for_upload_port=true
PMM0680.upload.native_usb=true
PMM0680.build.mcu=cortex-m0plus
PMM0680.build.f_cpu=48000000L
PMM0680.build.usb_product="pmm0680"
PMM0680.build.usb_manufacturer="PMM LLC"
PMM0680.build.board=pmm0680
PMM0680.build.core=arduino
PMM0680.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0680.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0680.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0680.build.variant=pmm0680
PMM0680.build.variant_system_lib=
PMM0680.build.vid=0x2341
PMM0680.build.pid=0x804d
PMM0680.bootloader.tool=openocd
PMM0680.bootloader.tool.default=openocd
PMM0680.bootloader.file=zero/samd21_sam_ba.bin

