Israr-Engineering/PMM-11XX-RENEWABLE/custom_Board/1.8.13/boards.txt
# PMM0680 (ESI Load Cell MODBUS TCP V2.2)
# --------------------------------------
PMM0680.name=PMM0680 (ESI Load Cell MODBUS TCP)
PMM0680.vid.0=0x2341
PMM0680.pid.0=0x804d
PMM0680.vid.1=0x2341
PMM0680.pid.1=0x004d
PMM0680.vid.2=0x2341
PMM0680.pid.2=0x824d
PMM0680.vid.3=0x2341
PMM0680.pid.3=0x024d
PMM0680.upload_port.0.vid=0x2341
PMM0680.upload_port.0.pid=0x804d
PMM0680.upload_port.1.vid=0x2341
PMM0680.upload_port.1.pid=0x004d
PMM0680.upload_port.2.vid=0x2341
PMM0680.upload_port.2.pid=0x824d
PMM0680.upload_port.3.vid=0x2341
PMM0680.upload_port.3.pid=0x024d
PMM0680.upload_port.4.board=arduino_zero_native
PMM0680.build.usb_product="PMM0680"
PMM0680.upload.tool=bossac
PMM0680.upload.tool.default=bossac
PMM0680.upload.tool.network=arduino_ota
PMM0680.upload.protocol=sam-ba
PMM0680.upload.maximum_size=262144
PMM0680.upload.maximum_data_size=32768
PMM0680.upload.use_1200bps_touch=true
PMM0680.upload.wait_for_upload_port=true
PMM0680.upload.native_usb=true
PMM0680.build.mcu=cortex-m0plus
PMM0680.build.f_cpu=48000000L
PMM0680.build.usb_product="pmm0680"
PMM0680.build.usb_manufacturer="PMM LLC"
PMM0680.build.board=pmm0680
PMM0680.build.core=arduino
PMM0680.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0680.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0680.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0680.build.variant=pmm0680
PMM0680.build.variant_system_lib=
PMM0680.build.vid=0x2341
PMM0680.build.pid=0x804d
PMM0680.bootloader.tool=openocd
PMM0680.bootloader.tool.default=openocd
PMM0680.bootloader.file=zero/samd21_sam_ba.bin


# PMM0681 (ESI Load Cell Weighing bridge Controller)
# --------------------------------------
PMM0681.name=PMM0681 (ESI Load Cell Weighing bridge Controller)
PMM0681.vid.0=0x2341
PMM0681.pid.0=0x804d
PMM0681.vid.1=0x2341
PMM0681.pid.1=0x004d
PMM0681.vid.2=0x2341
PMM0681.pid.2=0x824d
PMM0681.vid.3=0x2341
PMM0681.pid.3=0x024d
PMM0681.upload_port.0.vid=0x2341
PMM0681.upload_port.0.pid=0x804d
PMM0681.upload_port.1.vid=0x2341
PMM0681.upload_port.1.pid=0x004d
PMM0681.upload_port.2.vid=0x2341
PMM0681.upload_port.2.pid=0x824d
PMM0681.upload_port.3.vid=0x2341
PMM0681.upload_port.3.pid=0x024d
PMM0681.upload_port.4.board=arduino_zero_native
PMM0681.build.usb_product="PMM0681"
PMM0681.upload.tool=bossac
PMM0681.upload.tool.default=bossac
PMM0681.upload.tool.network=arduino_ota
PMM0681.upload.protocol=sam-ba
PMM0681.upload.maximum_size=262144
PMM0681.upload.maximum_data_size=32768
PMM0681.upload.use_1200bps_touch=true
PMM0681.upload.wait_for_upload_port=true
PMM0681.upload.native_usb=true
PMM0681.build.mcu=cortex-m0plus
PMM0681.build.f_cpu=48000000L
PMM0681.build.usb_product="pmm0681"
PMM0681.build.usb_manufacturer="PMM LLC"
PMM0681.build.board=pmm0681
PMM0681.build.core=arduino
PMM0681.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0681.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0681.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0681.build.variant=pmm0681
PMM0681.build.variant_system_lib=
PMM0681.build.vid=0x2341
PMM0681.build.pid=0x804d
PMM0681.bootloader.tool=openocd
PMM0681.bootloader.tool.default=openocd
PMM0681.bootloader.file=zero/samd21_sam_ba.bin

# PMM0682 ( ESI Hopper Scale Controller)
# --------------------------------------
PMM0682.name=PMM0682 ( ESI Hopper Scale Controller)
PMM0682.vid.0=0x2341
PMM0682.pid.0=0x804d
PMM0682.vid.1=0x2341
PMM0682.pid.1=0x004d
PMM0682.vid.2=0x2341
PMM0682.pid.2=0x824d
PMM0682.vid.3=0x2341
PMM0682.pid.3=0x024d
PMM0682.upload_port.0.vid=0x2341
PMM0682.upload_port.0.pid=0x804d
PMM0682.upload_port.1.vid=0x2341
PMM0682.upload_port.1.pid=0x004d
PMM0682.upload_port.2.vid=0x2341
PMM0682.upload_port.2.pid=0x824d
PMM0682.upload_port.3.vid=0x2341
PMM0682.upload_port.3.pid=0x024d
PMM0682.upload_port.4.board=arduino_zero_native
PMM0682.build.usb_product="PMM0682"
PMM0682.upload.tool=bossac
PMM0682.upload.tool.default=bossac
PMM0682.upload.tool.network=arduino_ota
PMM0682.upload.protocol=sam-ba
PMM0682.upload.maximum_size=262144
PMM0682.upload.maximum_data_size=32768
PMM0682.upload.use_1200bps_touch=true
PMM0682.upload.wait_for_upload_port=true
PMM0682.upload.native_usb=true
PMM0682.build.mcu=cortex-m0plus
PMM0682.build.f_cpu=48000000L
PMM0682.build.usb_product="pmm0682"
PMM0682.build.usb_manufacturer="PMM LLC"
PMM0682.build.board=pmm0682
PMM0682.build.core=arduino
PMM0682.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0682.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0682.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0682.build.variant=pmm0682
PMM0682.build.variant_system_lib=
PMM0682.build.vid=0x2341
PMM0682.build.pid=0x804d
PMM0682.bootloader.tool=openocd
PMM0682.bootloader.tool.default=openocd
PMM0682.bootloader.file=zero/samd21_sam_ba.bin

# PMM0683 ( ESI Convayor Belt scale Controller)
# --------------------------------------
PMM0683.name=PMM0683 ( ESI Convayor Belt scale Controller)
PMM0683.vid.0=0x2341
PMM0683.pid.0=0x804d
PMM0683.vid.1=0x2341
PMM0683.pid.1=0x004d
PMM0683.vid.2=0x2341
PMM0683.pid.2=0x824d
PMM0683.vid.3=0x2341
PMM0683.pid.3=0x024d
PMM0683.upload_port.0.vid=0x2341
PMM0683.upload_port.0.pid=0x804d
PMM0683.upload_port.1.vid=0x2341
PMM0683.upload_port.1.pid=0x004d
PMM0683.upload_port.2.vid=0x2341
PMM0683.upload_port.2.pid=0x824d
PMM0683.upload_port.3.vid=0x2341
PMM0683.upload_port.3.pid=0x024d
PMM0683.upload_port.4.board=arduino_zero_native
PMM0683.build.usb_product="PMM0683"
PMM0683.upload.tool=bossac
PMM0683.upload.tool.default=bossac
PMM0683.upload.tool.network=arduino_ota
PMM0683.upload.protocol=sam-ba
PMM0683.upload.maximum_size=262144
PMM0683.upload.maximum_data_size=32768
PMM0683.upload.use_1200bps_touch=true
PMM0683.upload.wait_for_upload_port=true
PMM0683.upload.native_usb=true
PMM0683.build.mcu=cortex-m0plus
PMM0683.build.f_cpu=48000000L
PMM0683.build.usb_product="pmm0683"
PMM0683.build.usb_manufacturer="PMM LLC"
PMM0683.build.board=pmm0683
PMM0683.build.core=arduino
PMM0683.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0683.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0683.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0683.build.variant=pmm0683
PMM0683.build.variant_system_lib=
PMM0683.build.vid=0x2341
PMM0683.build.pid=0x804d
PMM0683.bootloader.tool=openocd
PMM0683.bootloader.tool.default=openocd
PMM0683.bootloader.file=zero/samd21_sam_ba.bin

# PMM1002 (ESI IO Mirror 8x IO)
# --------------------------------------
PMM1002.name=PMM1002 (ESI IO Mirror 8x IO)
PMM1002.vid.0=0x2341
PMM1002.pid.0=0x804d
PMM1002.vid.1=0x2341
PMM1002.pid.1=0x004d
PMM1002.vid.2=0x2341
PMM1002.pid.2=0x824d
PMM1002.vid.3=0x2341
PMM1002.pid.3=0x024d
PMM1002.upload_port.0.vid=0x2341
PMM1002.upload_port.0.pid=0x804d
PMM1002.upload_port.1.vid=0x2341
PMM1002.upload_port.1.pid=0x004d
PMM1002.upload_port.2.vid=0x2341
PMM1002.upload_port.2.pid=0x824d
PMM1002.upload_port.3.vid=0x2341
PMM1002.upload_port.3.pid=0x024d
PMM1002.upload_port.4.board=arduino_zero_native
PMM1002.build.usb_product="PMM1002"
PMM1002.upload.tool=bossac
PMM1002.upload.tool.default=bossac
PMM1002.upload.tool.network=arduino_ota
PMM1002.upload.protocol=sam-ba
PMM1002.upload.maximum_size=262144
PMM1002.upload.maximum_data_size=32768
PMM1002.upload.use_1200bps_touch=true
PMM1002.upload.wait_for_upload_port=true
PMM1002.upload.native_usb=true
PMM1002.build.mcu=cortex-m0plus
PMM1002.build.f_cpu=48000000L
PMM1002.build.usb_product="pmm0683"
PMM1002.build.usb_manufacturer="PMM LLC"
PMM1002.build.board=pmm1002
PMM1002.build.core=arduino
PMM1002.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM1002.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM1002.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM1002.build.variant=pmm1002
PMM1002.build.variant_system_lib=
PMM1002.build.vid=0x2341
PMM1002.build.pid=0x804d
PMM1002.bootloader.tool=openocd
PMM1002.bootloader.tool.default=openocd
PMM1002.bootloader.file=zero/samd21_sam_ba.bin


# PMM1003 (ESI IO Mirror 16x IO)
# --------------------------------------
PMM1003.name=PMM1003 (ESI IO Mirror 16x IO)
PMM1003.vid.0=0x2341
PMM1003.pid.0=0x804d
PMM1003.vid.1=0x2341
PMM1003.pid.1=0x004d
PMM1003.vid.2=0x2341
PMM1003.pid.2=0x824d
PMM1003.vid.3=0x2341
PMM1003.pid.3=0x024d
PMM1003.upload_port.0.vid=0x2341
PMM1003.upload_port.0.pid=0x804d
PMM1003.upload_port.1.vid=0x2341
PMM1003.upload_port.1.pid=0x004d
PMM1003.upload_port.2.vid=0x2341
PMM1003.upload_port.2.pid=0x824d
PMM1003.upload_port.3.vid=0x2341
PMM1003.upload_port.3.pid=0x024d
PMM1003.upload_port.4.board=arduino_zero_native
PMM1003.build.usb_product="PMM1003"
PMM1003.upload.tool=bossac
PMM1003.upload.tool.default=bossac
PMM1003.upload.tool.network=arduino_ota
PMM1003.upload.protocol=sam-ba
PMM1003.upload.maximum_size=262144
PMM1003.upload.maximum_data_size=32768
PMM1003.upload.use_1200bps_touch=true
PMM1003.upload.wait_for_upload_port=true
PMM1003.upload.native_usb=true
PMM1003.build.mcu=cortex-m0plus
PMM1003.build.f_cpu=48000000L
PMM1003.build.usb_product="pmm1003"
PMM1003.build.usb_manufacturer="PMM LLC"
PMM1003.build.board=pmm1003
PMM1003.build.core=arduino
PMM1003.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM1003.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM1003.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM1003.build.variant=pmm1003
PMM1003.build.variant_system_lib=
PMM1003.build.vid=0x2341
PMM1003.build.pid=0x804d
PMM1003.bootloader.tool=openocd
PMM1003.bootloader.tool.default=openocd
PMM1003.bootloader.file=zero/samd21_sam_ba.bin


# PMM1010 ( SI AVS Advanced)
# --------------------------------------
PMM1010.name=PMM1010 ( SI AVS Advanced)
PMM1010.vid.0=0x2341
PMM1010.pid.0=0x804d
PMM1010.vid.1=0x2341
PMM1010.pid.1=0x004d
PMM1010.vid.2=0x2341
PMM1010.pid.2=0x824d
PMM1010.vid.3=0x2341
PMM1010.pid.3=0x024d
PMM1010.upload_port.0.vid=0x2341
PMM1010.upload_port.0.pid=0x804d
PMM1010.upload_port.1.vid=0x2341
PMM1010.upload_port.1.pid=0x004d
PMM1010.upload_port.2.vid=0x2341
PMM1010.upload_port.2.pid=0x824d
PMM1010.upload_port.3.vid=0x2341
PMM1010.upload_port.3.pid=0x024d
PMM1010.upload_port.4.board=arduino_zero_native
PMM1010.build.usb_product="PMM1010"
PMM1010.upload.tool=bossac
PMM1010.upload.tool.default=bossac
PMM1010.upload.tool.network=arduino_ota
PMM1010.upload.protocol=sam-ba
PMM1010.upload.maximum_size=262144
PMM1010.upload.maximum_data_size=32768
PMM1010.upload.use_1200bps_touch=true
PMM1010.upload.wait_for_upload_port=true
PMM1010.upload.native_usb=true
PMM1010.build.mcu=cortex-m0plus
PMM1010.build.f_cpu=48000000L
PMM1010.build.usb_product="pmm1010"
PMM1010.build.usb_manufacturer="PMM LLC"
PMM1010.build.board=pmm1010
PMM1010.build.core=arduino
PMM1010.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM1010.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM1010.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM1010.build.variant=pmm1010
PMM1010.build.variant_system_lib=
PMM1010.build.vid=0x2341
PMM1010.build.pid=0x804d
PMM1010.bootloader.tool=openocd
PMM1010.bootloader.tool.default=openocd
PMM1010.bootloader.file=zero/samd21_sam_ba.bin

# PMM1102 (SI Tracker Position Sensor)
# --------------------------------------
PMM1102.name=PMM1102 (SI Tracker Position Sensor)
PMM1102.vid.0=0x2341
PMM1102.pid.0=0x804d
PMM1102.vid.1=0x2341
PMM1102.pid.1=0x004d
PMM1102.vid.2=0x2341
PMM1102.pid.2=0x824d
PMM1102.vid.3=0x2341
PMM1102.pid.3=0x024d
PMM1102.upload_port.0.vid=0x2341
PMM1102.upload_port.0.pid=0x804d
PMM1102.upload_port.1.vid=0x2341
PMM1102.upload_port.1.pid=0x004d
PMM1102.upload_port.2.vid=0x2341
PMM1102.upload_port.2.pid=0x824d
PMM1102.upload_port.3.vid=0x2341
PMM1102.upload_port.3.pid=0x024d
PMM1102.upload_port.4.board=arduino_zero_native
PMM1102.build.usb_product="PMM1102"
PMM1102.upload.tool=bossac
PMM1102.upload.tool.default=bossac
PMM1102.upload.tool.network=arduino_ota
PMM1102.upload.protocol=sam-ba
PMM1102.upload.maximum_size=262144
PMM1102.upload.maximum_data_size=32768
PMM1102.upload.use_1200bps_touch=true
PMM1102.upload.wait_for_upload_port=true
PMM1102.upload.native_usb=true
PMM1102.build.mcu=cortex-m0plus
PMM1102.build.f_cpu=48000000L
PMM1102.build.usb_product="pmm1102"
PMM1102.build.usb_manufacturer="PMM LLC"
PMM1102.build.board=pmm1102
PMM1102.build.core=arduino
PMM1102.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM1102.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM1102.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM1102.build.variant=pmm1102
PMM1102.build.variant_system_lib=
PMM1102.build.vid=0x2341
PMM1102.build.pid=0x804d
PMM1102.bootloader.tool=openocd
PMM1102.bootloader.tool.default=openocd
PMM1102.bootloader.file=zero/samd21_sam_ba.bin

# PMM1103 (SI Tracker Control Unit)
# --------------------------------------
PMM1103.name=PMM1103 (SI Tracker Control Unit)
PMM1103.vid.0=0x2341
PMM1103.pid.0=0x804d
PMM1103.vid.1=0x2341
PMM1103.pid.1=0x004d
PMM1103.vid.2=0x2341
PMM1103.pid.2=0x824d
PMM1103.vid.3=0x2341
PMM1103.pid.3=0x024d
PMM1103.upload_port.0.vid=0x2341
PMM1103.upload_port.0.pid=0x804d
PMM1103.upload_port.1.vid=0x2341
PMM1103.upload_port.1.pid=0x004d
PMM1103.upload_port.2.vid=0x2341
PMM1103.upload_port.2.pid=0x824d
PMM1103.upload_port.3.vid=0x2341
PMM1103.upload_port.3.pid=0x024d
PMM1103.upload_port.4.board=arduino_zero_native
PMM1103.build.usb_product="PMM1103"
PMM1103.upload.tool=bossac
PMM1103.upload.tool.default=bossac
PMM1103.upload.tool.network=arduino_ota
PMM1103.upload.protocol=sam-ba
PMM1103.upload.maximum_size=262144
PMM1103.upload.maximum_data_size=32768
PMM1103.upload.use_1200bps_touch=true
PMM1103.upload.wait_for_upload_port=true
PMM1103.upload.native_usb=true
PMM1103.build.mcu=cortex-m0plus
PMM1103.build.f_cpu=48000000L
PMM1103.build.usb_product="pmm1103"
PMM1103.build.board=pmm1103
PMM1103.build.core=arduino
PMM1103.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM1103.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM1103.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM1103.build.variant=pmm1103
PMM1103.build.variant_system_lib=
PMM1103.build.vid=0x2341
PMM1103.build.pid=0x804d
PMM1103.bootloader.tool=openocd
PMM1103.bootloader.tool.default=openocd
PMM1103.bootloader.file=zero/samd21_sam_ba.bin
